<HTML>
<H1><A NAME="2"></A>2 Produciendo Sonido</H1>
<P>Muchos usuarios han escrito preguntando por qu&eacute; no pueden
lograr que Rosegarden haga alg&uacute;n sonido. Es la pregunta m&aacute;s
com&uacute;n realizada en la lista de correo de usuarios de
Rosegarden, y especialmente es un problema para aquellos que han
migrado a Linux desde Windows recientemente. Antes de que inicimos
Rosegarden por primera vez, quiero explicar qu&eacute; es necesario
para pavimentar el camino y tener una buena primer experiencia.
Algunos de ustedes ya saben esto, y est&aacute;n invitados a saltar
al pr&oacute;ximo cap&iacute;tulo, donde la parte interesante
comienza.</P>
<P>El t&oacute;pico del sonido cubre dos &aacute;reas diferentes que
pueden o no ser co-dependientes, dependiendo del hardware y software
que tengas disponible. Por un lado, hay muchos requerimientos que
tienen que ser alcanzados para reproducir MIDI con Rosegarden, y por
el otro, es necesario conseguir que el server JACK est&eacute;
levantado y corriendo de forma segura para hacer uso de las
caracter&iacute;sticas de audio de Rosegarden. Un servidor JACK es
tambi&eacute;n requerido para reproducir MIDI con plugins sint&eacute;ticos
(synth plugins), o para reproducir m&aacute;s de un sintetizador por
software ALSA al mismo tiempo. Poner a Rosegarden a hacer cualquier
sonido puede ser un asunto complicado pero, con suerte, yo te puedo
ayudar a lidiar con cualquier conjunto de circunstancias por las
cuales pas&eacute; antes que t&uacute;. Yo no puedo, sin embargo,
cubrir cada detalle en cuanto a lograr que cualquier placa de sonido
funcione con cualquier distribuci&oacute;n. Me temo que tendr&eacute;
que dejar algunas preguntas sin resolver, para que &eacute;ste
cap&iacute;tulo no se convierta en s&iacute; mismo en un libro.</P>
<P>Aqu&iacute; se encuentra, a modo de vistazo, un mapa de carretera
mostrando todos los posibles caminos para producir sonido con
Rosegarden. Es bastante dif&iacute;cil, lo s&eacute;, pero espero que
te pueda ayudar a darte una idea:</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/sound-diagram-master.jpg" NAME="Graphic16" ALIGN=BOTTOM WIDTH=614 HEIGHT=580 BORDER=0></P>
<H2><A NAME="2_1"></A>2.1 Reproduciendo MIDI:</H2>
<P>MIDI bajo Linux es un asunto un poco complicado. El hardware
disponible se divide en tres grandes categor&iacute;as, cada una con
su consideraci&oacute;n especial. Hardware MIDI externo<FONT COLOR="#0000ff">
(External MIDI hardware)</FONT>,<FONT COLOR="#5c8526"> hardware
interno soportado por ALSA</FONT>, y hardware interno no soportado
por ALSA. La &uacute;ltima categor&iacute;a se divide en:<FONT COLOR="#9966cc">
ALSA soft synths</FONT> (sintetizadores ALSA por software) y<FONT COLOR="#5e11a6">
synth plugins (plugins sintetizadores)</FONT>, que son similares pero
ligeramente distintos.</P>
<H3><A NAME="2_1_1"></A>2.1.1 &iquest;Qu&eacute; hay en mi PC?</H3>
<P>Si no tienes ni idea sobre lo que hay dentro de tu PC, y no tienes
ni idea sobre c&oacute;mo configurar cualquiera de estas cosas, un
buen lugar para comenzar es peg&aacute;ndole una mirada y ver cu&aacute;n
lejos ha llegado tu distribuci&oacute;n en darte cosas gratis y
libres. La mayor&iacute;a de las distribuciones deber&iacute;an
cargar ALSA en lugar de OSS (el viejo sistema de sonido), y ellas
deber&iacute;an detectar y configurar una gran variedad de placas de
sonido para ti autom&aacute;ticamente. KDE tiene un &uacute;til
centro de informaci&oacute;n que puede mostrar informaci&oacute;n
acerca de la configuraci&oacute;n de sonido. T&iacute;picamente se
encuentra en el men&uacute; KDE dentro de <B>Sistema -&gt; Centro de
informaci&oacute;n</B>, o puedes correrlo manualmente tipeando
&quot;kinfocenter&quot; dentro de la ventana &ldquo;Ejecutar Comando&rdquo;
(<B>alt</B>+ <B>F2)</B>.</P>
<P>Aqu&iacute; hay un ejemplo con explicaciones superpuestas en el
screenshot:</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/sound-kinfocenter.png" NAME="Graphic1" ALIGN=BOTTOM WIDTH=757 HEIGHT=623 BORDER=0></P>
<P ALIGN=LEFT>Diferentes placas de sonido tendr&aacute;n distintas
caracter&iacute;sticas/capacidades. La mayor&iacute;a de ellas, por
ejemplo, no listar&aacute;n nada en &ldquo;dispositivos sint&eacute;ticos&rdquo;
(synth devices).</P>
<H3><A NAME="2_1_2"></A>2.1.2 Interfaces MIDI externas</H3>
<P>Por lejos, el m&aacute;s complicado, y el modo m&aacute;s caro
para reproducir MIDI bajo Linux es usar equipamiento MIDI real. Esto
incluye teclados electr&oacute;nicos, m&oacute;dulos de sonido, y
quiz&aacute;s tambi&eacute;n guitarras MIDI. Un basto rango de
equipamiento est&aacute; disponible para este prop&oacute;sito, desde
teclados muy baratos a elementos electr&oacute;nicos de calidad
profesional. El costo var&iacute;a desde cientos a miles de d&oacute;lares,
y ese no ser&iacute;a el modo de conducirse a menos que te tomes muy
seriamente el sistema MIDI. 
</P>
<P>Ser&iacute;as bastante afortunado de tener semejante equipamiento,
y probablemente tendr&iacute;as alguna idea sobre c&oacute;mo hacerlo
funcionar en tu PC. Si el equipamiento tiene la habilidad de producir
sonido por s&iacute; mismo, como lo hacen algunos teclados MIDI, t&uacute;
podr&iacute;as querer usar esos parlantes para reproducir MIDI. Si tu
equipamiento MIDI no tiene parlantes o si t&uacute; intentas grabar
la salida de audio desde &eacute;ste equipamiento, probablemente
querr&iacute;as conectar la salida de audio de tu teclado o m&oacute;dulo
de sonido en una entrada de audio en tu placa de sonido. &Eacute;sto
te permitir&aacute; dirigir todo hacia el <FONT COLOR="#ff8080">mezclador
de la placa de sonido</FONT>. Hay muchas elecciones en cuanto a
interfaces MIDI externas.</P>
<H4><A NAME="2_1_2_1"></A>2.1.2.1 Adaptadores MIDI de puerto de
joystick</H4>
<P>La ruta (forma) m&aacute;s simple y menos cara es el adaptador
MIDI en puerto joystick. Se encuentra en muchas placas de sonido
comunes, de bajo costo (low-end), c&oacute;mo la Sound Blaster PCI
128 (snd-ens1371). Puede ser un poco dif&iacute;cil lograr conectar
un cable &ldquo;Y-cable&rdquo; adecuado o una caja MIDI (MIDI box) al
adaptador, y probablemente tendr&aacute;s que conseguir uno online.
Con el adaptador correcto en la mano, todo lo que queda es conectar
tu equipamiento en la caja MIDI, o en el cable usando cables MIDI de
5-pin DIN standard, con el driver snd-ens1371, y esos para muchas
placas de sonido similares, es solamente cuesti&oacute;n de
asegurarse de que los m&oacute;dulos <FONT FACE="courier 10 pitch">snd-seq-midi</FONT>
y <FONT FACE="courier 10 pitch">snd-rawmidi</FONT> est&eacute;n
cargados (usando el mecanismo particular que tu distribuci&oacute;n
provee para esa funci&oacute;n).</P>
<H4><A NAME="2_1_2_2"></A>2.1.2.2 MIDI USB</H4>
<P>USB est&aacute; suplantando el modo tradicional en conexiones MIDI
por cable, y muchos fabricantes est&aacute;n produciendo teclados que
se conectan directo a tu PC usando cables USB standard. Hay tambi&eacute;n
disponibles, dispositivos que proveen interfaces MIDI multi-puertos.
Estas interfaces se conectan a tu PC usando un cable USB, y proveen
muchos sockets (enchufes) MIDI tradicionales de 5-pin.</P>
<H5><A NAME="2_1_2_2_1"></A>2.1.2.2.1 Teclados USB</H5>
<P><A HREF="http://www.evolution.co.uk/">Evolution</A> construye
muchos modelos que son conocidos por alcanzar las especificaciones
del MIDI USB, que son, por ende, compatibles con Linux. Chris Cannam,
uno de los principales desarrolladores de Rosegarden, usa un teclado
Evolution-2, y reporta que &eacute;ste funciona usando el m&oacute;dulo
snd-usb-audio, que debe ser probablemente cargado autom&aacute;ticamente
por hotplug. &Eacute;l imagina que la mayor&iacute;a de los otros
productos de otros fabricantes son similares.</P>
<P><A NAME="2_1_2_2_2"></A>2.1.2.2.2 Interfaces MIDI USB</P>
<P>Las interfaces Edriol UM-2 y mAudio MidiSport 2x2 son conocidas
por trabajar bajo Linux. No tengo experiencias con estas cosas yo
mismo, entonces, s&oacute;lo puedo proveer informaci&oacute;n de
segunda mano. 
</P>
<P>Pedro Lopez-Cabanillas, un desarrollador contribuyente de
Rosegarden, reporta que hacer andar Edirol UM-2 es tan simple como
conectar el cable USB y cargar el m&oacute;dulo snd-usb-audio, que
debe ser probablemente cargado por hotplug.</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/usbmidi-PLC.jpg" NAME="Graphic2" ALIGN=BOTTOM WIDTH=609 HEIGHT=363 BORDER=0></P>
<P ALIGN=CENTER><I>Las Interfaces USB MIDI de Pedro
Lopez-Cabanillas...</I></P>
<P>Pedro y Chris, ambos reportan que las interfaces mAudio MidiSport
son m&aacute;s complicadas para hacerlas funcionar. Pedro reporta que
&ldquo;algunas de ellas requieren un programa firmware cargado dentro
de la RAM del dispositivo antes de que puedas usarlo. Hay firmwares
GPL (paquete ezusbmidi) para los dispositivos 1-port and 2-port
(hasta Midisport2x2), ellos son proveidos como paquetes RPM para Red
Hat por<A HREF="http://ccrma.stanford.edu/planetccrma/software/">
CCRMA,</A> y para Mandrake por <A HREF="http://rpm.nyvalls.se/">Thac</A>.
Tambi&eacute;n hay paquetes listos para usar para AGNULA/Debian y
Gentoo, o t&uacute; puedes retocar y compilar el firmware desde sus
fuentes&rdquo;. Chris reporta que los usuarios con los kernels de las
series 2.6 pueden tener dificultades usando estos dispositivos. Pedro
sugiere que le des un vistazo a la informaci&oacute;n disponible en
<A HREF="http://ccrma.stanford.edu/planetccrma/software/usbmidi.html">zero
config environment</A> disponible en CCRMA si est&aacute;s corriendo
Red Hat o Fedora.</P>
<H3><A NAME="2_1_3"></A>2.1.3 MIDI sin hardware externo</H3>
<P>Para aquellos sin un hardware externo disponible, hay dos
categor&iacute;as restantes. Unas pocas placas de sonido tienen
infraestructura MIDI construida internamente que ALSA pueda usar. El
resto de la gente deber&aacute; usar alg&uacute;n tipo de
sintetizador por software.</P>
<H4><A NAME="2_1_3_1"></A>2.1.3.1 Placas son soporte para
sintetizador bajo ALSA</H4>
<P>&Eacute;ste es el pr&oacute;ximo y m&aacute;s f&aacute;cil camino
para lograr que el MIDI funcione. Que yo sepa, &eacute;sta categor&iacute;a
solamente se aplica a esas placas de sonido basadas en un chipset
Emu, como la serie Sound Blaster Live!/Audigy (snd-emu10k1), y la AWE
32/64 (snd-emu8000). Yo tengo una Sound Blaster Live! Value Edition y
puedo reportar que es f&aacute;cil hacerla funcionar, y suena
razonablemente decente.</P>
<H5><A NAME="2_1_3_1_1"></A>2.1.3.1.1 SB Live!, M&oacute;dulos</H5>
<P>Primero tendr&aacute;s que asegurarte de tener los m&oacute;dulos
apropiados cargados en el kernel, y que est&aacute;s usando los
m&oacute;dulos ALSA, que tienen &ldquo;snd&rdquo; en el nombre. Si tu
distribuci&oacute;n tiene una linda utilidad para este prop&oacute;sito
&uacute;sala. Yo no pude encontrar una utilidad gr&aacute;fica de
reporte de m&oacute;dulos que est&eacute; disponible universalmente.
La &uacute;nica alternativa que puedo darte que est&aacute;
comprobada en cuanto a funcionar en todas las distribuciones supone
meterse en la temida l&iacute;nea de comando para ingresar un comando
como:</P>
<P STYLE="margin-left: 1.25cm"><FONT FACE="courier 10 pitch">lsmod |
grep snd</FONT></P>
<P>Yo tengo los siguientes m&oacute;dulos cargados para SB Live!:</P>
<P STYLE="margin-left: 2.01cm"><FONT FACE="courier 10 pitch">snd-seq-oss
snd-seq-midi snd-emu10k1-synth snd-emux-synth</FONT></P>
<P STYLE="margin-left: 2.01cm"><FONT FACE="courier 10 pitch">snd-seq-midi-emul
snd-seq-virmidi snd-seq-midi-event snd-seq</FONT></P>
<P STYLE="margin-left: 2.01cm"><FONT FACE="courier 10 pitch">snd-emu10k1
snd-pcm-oss snd-mixer-oss snd-pcm snd-timer</FONT></P>
<P STYLE="margin-left: 2.01cm"><FONT FACE="courier 10 pitch">snd-hwdep
snd-util-mem snd-page-alloc snd-ac97-codec</FONT></P>
<P STYLE="margin-left: 2.01cm"><FONT FACE="courier 10 pitch">snd-rawmidi
snd-seq-device snd soundcore</FONT></P>
<P><FONT FACE="arial, sans-serif"><I>Si no ves &ldquo;snd&rdquo;
ciertamente tienes cargados los m&oacute;dulos (drivers) incorrectos
(OSS, el viejo sistema de sonido), o no hay m&oacute;dulos (drivers)
de sonido cargados de ning&uacute;n tipo. Solucionar eso est&aacute;
m&aacute;s all&aacute; del marco de &eacute;ste libro, siendo que hay
tantas diferencias entre las distribuciones Linux. Me temo que
deber&aacute;s referirte a cualquier fuente de ayuda que tu
distribuci&oacute;n provea en tal caso.</I></FONT></P>
<H5><A NAME="2_1_3_1_2"></A>2.1.3.1.2 Configurar el volumen del
mezclador</H5>
<P>Luego deber&aacute;s chequear para asegurarte de que has subido
los vol&uacute;menes de tu mezclador. Cubrir&eacute; este complicado
mezclador en detalle cuando hable acerca de manejar varias entradas y
salidas con el prop&oacute;sito de grabar audio. Por el momento,
deber&iacute;a ser suficiente asegurar que el canal &ldquo;music&rdquo;
posea un volumen alto. Mi mezclador preferido es<A HREF="http://www.suse.de/~mana/kalsatools.html">
KAmix</A>. Desafortunadamente no est&aacute; disponible extensamente
fuera de SuSE, y probablemente deber&aacute;s compilarlo t&uacute;
mismo (tuve que resolver bastantes problemas para compilarlo por m&iacute;
mismo en Debian). No es el mezclador m&aacute;s bonito pero es el
&uacute;nico que he encontrado que me permite controlar mi Sound
Blaster Live! consistentemente y eficientemente para lograr los
resultados que quiero.</P>
<H5><A NAME="2_1_3_1_3"></A>2.1.3.1.3 Cargar una SoundFont</H5>
<P>Finalmente, necesitar&aacute;s cargar un soundfont dentro de la
placa. Estas placas usan soundfonts .sf2 que est&aacute;n ya
disponibles. No estoy informado de un soundfont lo suficientemente
libre para ser incluido con cualquier distribuci&oacute;n Linux,
entonces m&aacute;s que nada deber&aacute;s obtener uno desde la web,
o quiz&aacute;s desde el CD que viene con tu placa de sonido. He
tenido buena suerte con soundfonts del sitio de <A HREF="http://www.personalcopy.com/linuxfiles.htm">Personal
Copy, </A>pero no doy ninguna garant&iacute;a expresa o impl&iacute;cita
a cerca de lo adecuado o la legalidad de sus soundfonts, o cualquier
otros soundfonts que t&uacute; puedas obtener en la web para
cualquier prop&oacute;sito particular.</P>
<P>Una vez que t&uacute; hayas obtenido un soundfont, necesitar&aacute;s
cargarlo en la placa. No hay actualmente ninguna interfaz de usuario
amigable para manejar &eacute;sto. Estoy desarrollando una utilidad
para &eacute;ste prop&oacute;sito, pero no tengo tiempo para
terminarla antes de publicar &eacute;ste libro, entonces no har&eacute;
referencia a ella. Por el momento, tus dos alternativas son correr la
utilidad de l&iacute;nea de comando <B>asfxload, </B>o configurar
Rosegarden para cargar un soundfont para t&iacute; en el inicio, v&iacute;a
<B>Settings -&gt; Configure Rosegarden -&gt; Sequencer -&gt; General</B></P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/configure-soundfont.png" NAME="Graphic17" ALIGN=BOTTOM WIDTH=835 HEIGHT=440 BORDER=0></P>
<P ALIGN=CENTER><BR><BR>
</P>
<H4><A NAME="2_1_3_2"></A>2.1.3.2 Placas de sonido sin soporte para
sintetizador bajo ALSA</H4>
<P>Esta es realmente la categor&iacute;a &ldquo;todo lo dem&aacute;s&rdquo;.
Incluye demasiadas placas de sonido como para listarlas; cada una con
su propio set de m&oacute;dulos. Las Sound Blaster PCI y Ensoniq
AudioPCI (ens-1370, ens-1371, ens-1373), y los integrados
snd-intel8x0 y snd-v&iacute;a82xx son probablemente las mas comunes,
pero las placas de sonido que entran dentro de &eacute;sta categor&iacute;a
son una legi&oacute;n. El proceso para lograr que ellas reproduzcan
MIDI es similar en todos los casos.</P>
<H5><A NAME="2_1_3_2_1"></A>2.1.3.2.1 Cheque&aacute; tus m&oacute;dulos</H5>
<P>Primero necesitas asegurarte de que tienes la infraestructura MIDI
ALSA cargando los siguientes m&oacute;dulos en adici&oacute;n a
cualquier otro m&oacute;dulo que requieras para tu hardware en
particular:</P>
<P STYLE="margin-left: 2.01cm"><FONT FACE="courier 10 pitch">snd-seq-midi
snd-seq-virmidi snd-seq-midi-event snd-seq</FONT></P>
<P STYLE="margin-left: 2.01cm"><FONT FACE="courier 10 pitch">snd-timer
snd-rawmidi snd soundcore</FONT></P>
<P><I>(La lista de arriba fue extrapolada del ejemplo previo, y
contiene m&oacute;dulos que no se van a cargar actualmente con tu
hardware particular. Si cargar uno o mas de los m&oacute;dulos
listados falla, no te preocupes a cerca de eso a menos que
posteriormente encuentres que tu subsistema MIDI no funciona.)</I></P>
<H5><A NAME="2_1_3_2_2"></A>2.1.3.2.2 QSynth</H5>
<P>El modo menos complicado para lograr que una de &eacute;stas
placas de sonido reproduzca MIDI es usar<A HREF="http://qsynth.sourceforge.net/">
QSynth</A>. Es simple usar un soft synth ALSA que toma los datos MIDI
como entrada y usa el formato <B>.sf2</B> para prodicir una salida de
audio. En su m&aacute;s simple configuraci&oacute;n puede usar ALSA
para salida de audio, evadi&eacute;ndo la necesidad de correr JACK.
Si t&uacute; tambi&eacute;n necesitas o quieres correr JACK, &eacute;ste
puede conectar su salida a JACK. En su configuraci&oacute;n, t&uacute;
puedes tambi&eacute;n usar una variedad de otros sintetizadores por
soft como<A HREF="http://hydrogen.sourceforge.net/"> Hydrogen</A> y<A HREF="http://zynaddsubfx.sourceforge.net/">
ZynAddSubFX</A>, todos compartiendo la misma salida de audio. QSynth
es el m&aacute;s &uacute;til para producci&oacute;n de m&uacute;sica
en general, y por eso mi foco est&aacute; aqu&iacute;. 
</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/qsynth-main.png" NAME="Graphic19" ALIGN=BOTTOM WIDTH=849 HEIGHT=187 BORDER=0></P>
<H6><A NAME="2_1_3_2_2_1"></A>2.1.3.2.2.1 Configurar el driver de
audio</H6>
<P>La primer decisi&oacute;n que deber&aacute;s tomar es usar ALSA o
JACK como salida. Esto supondr&aacute; iniciar y configurar JACK en
detalle en un momento. No importa qu&eacute; opci&oacute;n elijas,
ambas son configuradas por medio del bot&oacute;n <B>Setup. </B>En
&eacute;ste ejemplo estoy usando JACK. Toma especial nota de que yo
he ajustado el sample rate para ser igual al que estoy usando con
JACK, que es 48,000 Hz (por razones que voy a explicar directamente).
Tambi&eacute;n nota que yo he chequeado <B>[x] Auto Connect JACK
Outputs</B>. Esto permite a Qsynth hacer su propia conexi&oacute;n
por defecto con JACK, que es muy conveniente.<IMG SRC="../pixmaps/qsynth-audio-setup.png" NAME="Graphic18" ALIGN=BOTTOM WIDTH=598 HEIGHT=385 BORDER=0></P>
<H6><A NAME="2_1_3_2_2_2"></A>2.1.3.2.2.2 Cargando un SoundFont</H6>
<P>Finalmente es necesario cargar al menos un soundfont. Estos son
los mismos <B>.sf2</B> soundfonts usados por las series de placas SB
Live!, y son cargados v&iacute;a diferentes solapas en la misma
p&aacute;gina de setup.</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/qsynth-soundfonts.png" NAME="Graphic20" ALIGN=BOTTOM WIDTH=598 HEIGHT=385 BORDER=0></P>
<H5><A NAME="2_1_3_2_3"></A>2.1.3.2.3 Plugins Sint&eacute;ticos
(Synth Plugins)</H5>
<P>Tambi&eacute;n es posible reproducir usando synth plugins. Hay un
plugin FluidSynth-DSSI que provee esencialmente la misma
funcionalidad que QSynth, excepto que est&aacute; integrado
directamente a Rosegarden. Lo describir&eacute; en detalle cuando
hable acerca de asignar instrumentos a pistas, porque su
configuraci&oacute;n y uso es enteramente interna en Rosegarden. Por
el momento es suficiente saber que existe, y que requiere un server
JACK funcionando correctamente.</P>
<H2><A NAME="2_2"></A>2.2 Reproduciendo Audio</H2>
<P>Para reproducir audio necesitar&aacute;s correr JACK.</P>
<H3><A NAME="2_2_1"></A>2.2.1 &iquest;Qu&eacute; es JACK?</H3>
<P>JACK es una abreviaci&oacute;n de Jack Audio Connection Kit. JACK
es un flexible servidor de audio que permite a sus aplicaciones
clientes compartir el hardware de audio de un modo similar, y
compartir un transporte en com&uacute;n. Provee mecanismos flexibles
para dirigir entradas y salidas hacia y desde aplicaciones clientes
usando un simulador de cable (jack-and-cable metaphor). Fue
construido para los profesionales en audio que quieren obtener la
mejor posible performance de su hardware, pero siendo profesional o
no, es algo que deber&aacute;s entender si quieres reproducir audio
con Rosegarden.</P>
<H3><A NAME="2_2_2"></A>2.2.2 Obteniendo un Kernel adecuado</H3>
<P>Es te&oacute;ricamente posible correr JACK y Rosegarden con un
kernel ordinario, pero nunca obtendr&aacute;s resultados aceptables,
incluso en una m&aacute;quina con altas especificaciones. Poder en el
CPU y abundante RAM son insuficientes para garantizar la performance
requerida, y t&uacute;, desafortunadamente, necesitas correr un
kernel especializado. Afortunadamente, cosas como<A HREF="http://www.agnula.org/">
AGNULA</A> lo hacen mucho m&aacute;s f&aacute;cil de lo que sol&iacute;a
ser. Ahora es posible hacer trabajo en audio de calidad en Linux sin
haberse transformado en un experto haker del kernel. Tengo que
admitir que estaba impresionado con esto cuando finalmente vine a
probarlo por m&iacute; mismo. Si le&iacute;ste algunas de las
versiones de &eacute;ste libro previas al release (Rosegarden-4 1.0),
podr&aacute;s recordar varias declamaciones que escrib&iacute; a
cerca del audio en Linux a lo largo del camino. Puedo ahora reportar
que un feliz JACK puede ser tan simple como bajar alg&uacute;n kernel
de AGNULA o CCRMA, instalarlo y reiniciar. Los caprichos particulares
a cerca de instalar un kernel est&aacute;n fuera del marco de &eacute;ste
libro, pero yo estoy trabajando con &eacute;stos paquetes en mi PC 
Debian ( los usuarios de laptops pueden necesitar los m&oacute;dulos
PCMCIA tambi&eacute;n):</P>
<P STYLE="margin-left: 1.25cm"><FONT FACE="courier 10 pitch">alsa-modules-2.4.25-1-multimedia-686</FONT></P>
<P STYLE="margin-left: 1.25cm"><FONT FACE="courier 10 pitch">kernel-image-2.4.25-1-multimedia-686</FONT></P>
<P><FONT FACE="times new roman"><I>NOTA: El largo del camino puede
variar si tu quieres usar un kernel de las nuevas series 2.6.
Mientras escribo &eacute;sto ( 2.6.8 est&aacute; actualmente en
Debian unstable), no he escuchado todav&iacute;a que nadie obtuviera
buenos resultados trabajando con audio con los nuevos kernels. Alguna
de las capacidades puestas en el kernel de AGNULA han sido
incorporadas dentro del kernel 2.6,  pero no todas ellas. Te
recomiendo que te quedes con la serie 2.4 por ahora.</I></FONT></P>
<H3><A NAME="2_2_3"></A>2.2.3 Iniciando y afinando JACK</H3>
<P>El modo m&aacute;s simple de controlar tu server JACK es usando<A HREF="http://qjackctl.sourceforge.net/">
<FONT FACE="courier 10 pitch">qjackctl</FONT></A>. Es una aplicaci&oacute;n
muy &uacute;til que provee un modo conveniente de iniciar y parar tu
servidor JACK, para jugar con varios par&aacute;metros de
configuraci&oacute;n y encontrar la mejor combinaci&oacute;n para tu
hardware, y para manejar conexiones JACK entre aplicaciones.</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/qjackctl-overview.png" NAME="Graphic21" ALIGN=BOTTOM WIDTH=606 HEIGHT=127 BORDER=0></P>
<H3><A NAME="2_2_4"></A>2.2.4 Configurando el server JACK  
</H3>
<P ALIGN=LEFT>Para cambiar la configuraci&oacute;n de tu server JACK,
usa el bot&oacute;n <B>Setup. </B><SPAN STYLE="font-weight: medium">El
proceso que sigue probablemente ser&aacute; tedioso y consumir&aacute;
mucho tiempo, pero una vez que hayas descubierto los &ldquo;n&uacute;meros
m&aacute;gicos&rdquo; para tu hardware, despu&eacute;s de eso todo
deber&iacute;a continuar funcionando. El kernel &ldquo;parcheado&rdquo;
que has instalado le permite a JACK tener una prioridad m&aacute;s
alta que lo normal, y &eacute;sto requiere privilegios de
administrador (root). Deber&iacute;as configurar JACK para iniciar
usando &ldquo;jackstart&rdquo; as&iacute; podr&aacute;s correr
Rosegarden y JACK como un usuario normal.</SPAN></P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/qjackctl-silvan.png" NAME="Graphic25" ALIGN=BOTTOM WIDTH=657 HEIGHT=557 BORDER=0></P>
<P ALIGN=LEFT>Las configuraciones que se muestran son las que
funcionan mejor para m&iacute;  Sound Blaster Live!, y t&uacute;
probablemente tendr&aacute;s que hacer algunos cambios aqu&iacute;.
Si tienes m&aacute;s de una placa de sonido quiz&aacute;s necesites
cambiar el seteo &ldquo;Interface&rdquo;. Actualmente no tengo
ninguna experiencia en esa situaci&oacute;n, entonces est&aacute;s
por t&iacute; mismo para experimentar en ese caso.</P>
<P ALIGN=LEFT>Descubrir la mejor combinaci&oacute;n es un proceso que
consiste en jugar con &ldquo;Frames/Period&rdquo;, &quot;Sample Rate&quot;
y &quot;Periods/Buffer&quot;. Tu objetivo aqu&iacute; es encontrar la
m&aacute;s baja latencia posible, c&oacute;mo se reporta en la
esquina inferior derecha del di&aacute;logo. Mientras cambian las
configuraciones, &eacute;ste n&uacute;mero te mostrar&aacute; los
resultados brindados por esa combinaci&oacute;n. T&uacute; querr&aacute;s
alto el sample rate  y bajos  frames/periods y periods/buffer.</P>
<P ALIGN=LEFT>Te sugiero que logres la m&iacute;nima posible
latencia, click en <B>OK</B>, luego inicia el servidor JACK con el
bot&oacute;n <B>Start</B>  en el di&aacute;logo principal. Si el
server falla en iniciar, vuelve a &eacute;ste di&aacute;logo y
contin&uacute;a trabajando, cambiando par&aacute;metro por par&aacute;metro
hasta que encuentres una combinaci&oacute;n que funcione. Muchas
combinaciones de par&aacute;metros probablemente causar&aacute;n que
JACK falle inmediatamente. Deber&iacute;as r&aacute;pidamente obtener
una idea a cerca del rango de posibles valores que puedes usar y que
funcionen, y luego podr&aacute;s lograr la combinaci&oacute;n ideal
desde all&iacute;. (Por ejemplo, no es posible iniciar JACK en mi
hardware con un par&aacute;metro periods/buffer  distinto de dos,
entonces no hay nada que hacer salvo usar ese seteo y moverse hacia
un par&aacute;metro diferente.)</P>
<H4><A NAME="2_2_4_1"></A>2.2.4.1 El maligno XRUN</H4>
<P ALIGN=LEFT>Es muy importante evadir xruns. Si encuentras una
combinaci&oacute;n de par&aacute;metros de baja latencia que le
permitan al servidor JACK iniciar, pero que producen un
desbordamiento de xruns, est&aacute;s apuntando demasiado alto. Xruns
 son reportados en el di&aacute;logo principal de QJackCtl.
Idealmente deber&iacute;as ver &eacute;sto:</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/JACK-no-xruns.png" NAME="Graphic22" ALIGN=BOTTOM WIDTH=100 HEIGHT=59 BORDER=0></P>
<P ALIGN=LEFT>Si, por otro lado, ves algo como &eacute;sto, tienes un
problema por delante:</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/JACK-know-xruns.png" NAME="Graphic23" ALIGN=BOTTOM WIDTH=126 HEIGHT=59 BORDER=0></P>
<P ALIGN=LEFT>Nunca querr&aacute;s ver &eacute;sto muy rojo. Verlo
apenas un poco rojo es inaceptable, pero probablemente podr&aacute;s
continuar un poco mientras tus xruns  sean pocos y espaciados. Xruns
causan  p&eacute;rdida de audio; clicks, pops, distorsiones, efectos
del tipo flanger. Si obtienes mas de dos o tres en el curso de un
d&iacute;a, probablemente necesitas afinar JACK un poco y perder algo
de performance para ganar calidad.</P>
<H3><A NAME="2_2_5"></A>2.2.5 Manejando conexiones JACK 
</H3>
<P>Rosegarden establecer&aacute; conexiones correctas
autom&aacute;ticamente; as&iacute; lo har&aacute;n  QSynth e
Hydrogen, si los has configurado para hacer eso. ZynAddSubFX y quiz&aacute;s
otras aplicaciones JACK, no har&aacute;n &eacute;sto. Para ver y
cambiar las conexiones has click en el bot&oacute;n  <B>Connections</B>.
Hacer y deshacer conexiones es un proceso que consiste en marcar uno
o m&aacute;s &iacute;tems en el panel izquierdo y uno o m&aacute;s
&iacute;tems en el derecho, y luego usar los botones  <B>Connect</B>
o <B>Disconnect</B> como se requiera.</P>
<P ALIGN=CENTER><IMG SRC="../pixmaps/qjackctl-connections.png" NAME="Graphic26" ALIGN=BOTTOM WIDTH=619 HEIGHT=357 BORDER=0></P>
<P ALIGN=LEFT><I>NOTA: Puedes tambi&eacute;n usar QJackCtl para
manejar conexiones ALSA MIDI. No recomiendo que hagas eso mientras
est&aacute;s corriendo Rosegarden. Rosegarden tiene su propio MIDI
router, y no trabajar&aacute; apropiadamente si cambias las
conexiones MIDI externamente. De todos modos, si, por ejemplo,
quieres reproducir con tu Sound Blaster Live! o QSynth con tu teclado
MIDI sin correr Rosegarden, puedes usar las conexiones MIDI de
QjackCtl para conectarlo.</I></P>
</BODY>
</HTML>
