<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<BODY LANG="de">
	<H1 STYLE="border: none; padding: 0in; page-break-before: always"><A NAME="1"></A>
	Einleitung</H1>
	<H2 STYLE="border: none; padding: 0in"><A NAME="1_1"></A>Was ist Rosegarden?</H2>
	<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none; padding: 0in; font-style: normal">
	Rosegarden-4, im folgenden nur noch Rosegarden genant, ist
	ein vielseitiges Open-Source-Programm zur Musikerzeugung. Es 
        verbindet Aspekte eines Midi-Sequenzers, eines
	Audio-Sequenzers und eines Notationseditors in einem
	bequemen, m&auml;chtigen, einfach zu bedienenden Paket, das Benutzern eine
	stimmige und intuitive Oberfl&auml;che bietet.
	</P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
	Rosegarden macht Gebrauch von zwei m&auml;chtigen und flexiblen
        Subsystemen,die es f&uuml;r LINUX gibt. F&uuml;r den MIDI-Betrieb
      benutzt Rosegarden die ALSA (Advanced Linux Sound
      Architecture)-MIDI-Infrastruktur um eingehende- und ausgehende
      MIDI-Ereignisse zu steuern.Es kann von beliebig vielen Eing&auml;ngen
      gleichzeitig aufnehmen und ausgehende Ereignisse k&ouml;nnen zu
      jedem beliebigen MIDI-Client aus einer Myriade von MIDI-Clients
      geleitet werden.
     </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
	Zur Aufnahme und Wiedergabe ist Rosegarden eine von
      zahlreichen Anwendungen, die vom Jack Audio Connection Kit
    (Jack-Audio-Verbindungs-Satz) Gebrauch macht, 
    einem Sound-Server mit geringer Verz&ouml;gerung, der von Anfang an
    entworfen wurde, um den Bed&uuml;rfnissen professioneller Musiker zu
    begegnen. Hand in Hand mit JACK kann Rosegarden LADSPA-Plugins
    (Linux Audio Developer's Simple Plugin API) im laufenden Betrieb
    auf Audio-Streams anwenden und dabei Effekte erzeugen, die von EQ
    bis Echo-Effekten reichen und praktisch alle dazwischen. Diese
    Plugins k&ouml;nnen einander &uuml;berlagert werden und damit noch mehr
    M&ouml;glichkeiten geschaffen werden. </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
Rosegarden ist der erste MIDI-Sequenzer, der die neue
      DSSI-Plugin-Architektur (Disposable Soft Synth Interface)
      einsetzt und dabei eine Br&uuml;cke zwischen diesen beiden
      Technologien schl&auml;gt. MIDI-Ereignisse werden &uuml;ber ALSA in
      DSSI-Synth-Plugins gelenkt und Audio das von diesen Plugins
      produziert wird kann umgekehrt durch LADSPA-Plugins und von dort
      zu JACK gelenkt werden.
 </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
     Rosegarden liefert drei verschiedene Wege um MIDI-Ereignisse zu 
      betrachten, zu editieren und einzugeben, einschlie&szlig;lich eines
      Notationseditors, der viele fortgeschrittene Eigenschaften besitzt,
      die man normalerweise nicht in der Notationseinrichtung eines
      MIDI-Sequenzers findet. Unterhalb dieser drei Editoren liefert
      Rosegarden einen auf Segmenten basierenden Mechanismus, um
      Audio-und MIDI-Daten auf einer Leinwand zu arrangieren, die die
      M&ouml;glichkeiten eines Bildbearbeitungsprogramms, das mit Ebenen
      arbeitet, in das Reich der Musik bringt.
      
 </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
     Die ganze Flexibilit&auml;t bedeutet, da&szlig; Rosegarden als Mittelpunkt
      einer sehr m&auml;chtigen Heimstudio- und Musikkompositionsl&ouml;sung f&uuml;r
      Linux verwendet werden kann.
 </P>

	<H2 STYLE="border: none; padding: 0in"><A NAME="1_2"></A>
	&Uuml;ber diesen F&uuml;hrer 
	</H2>
	<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in; font-style: normal">
      Dieser F&uuml;hrer ist teilweise Handbuch, teilweise Tutorial. Ich
      versuche Rosegardens wichtigste Funktionen vorzustellen und
      zeige beispielhaft, wie diese Funktionen zum Erreichen
      musikalischer Ziele eingesetzt werden k&ouml;nnen.
      </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in; font-style: normal">
      Dieser F&uuml;hrer ist allgemein so gestaltet, da&szlig; er logisch  von
      Thema zu Thema und von Fenster zu Fenster durch Rosegardens
      Funktionsvorrat geht. Will man direkt zu einem
      bestimmten Thema springen, ist das Inhaltsverzeichnis
      komplett und die WEB-Version vollst&auml;ndig verlinkt.
      </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in; font-style: normal">
     Jedes Kapitel ist locker in zwei Teile gegliedert. Die erste H&auml;lfte
      beschreibt ausf&uuml;hrlich die mechanische Seite, wie man
      verschiedene Kontrollen einsetzt um Daten in irgendeiner Form zu
      manipulieren. Die zweite H&auml;lfte konzentriert sich auf die
      Demonstration, wie diese Kontrollen eingesetzt werden k&ouml;nnen, um
      g&auml;ngige musikalische Ziele zu erreichen.
      </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in; font-style: normal">
     Men&uuml;-Optionen und Referenzen zu irgendwelchen Dialogseiten oder 
      Tabulatoren sind fett formatiert und mit Pfeilen versehen, um
      den Fortschritt durch die Men&uuml;-Ebenen anzuzeigen. Wenn ich
      <b>File -> Import ->Import MIDI File</b> schreibe, bedeutet das:
      Beginne mit dem File-Men&uuml;, finde "Import" in diesem Men&uuml; und
      fahre dr&uuml;ber, bis das Untermen&uuml; sich &ouml;ffnet, dann clicke auf "MIDI-File".
      </P>
	<H2 STYLE="border: none; padding: 0in"><A NAME="1_3"></A>
	Version und Systemanforderungen</H2>
     
	<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
	Dieses Dokument beschreibt Rosegarden-4, die neuste Version
      dieser 
      ehrw&uuml;rdigen Anwendungsreihe. Ein paar Distributionen
      enthalten immer noch das &auml;ltere Rosegarden-2, das zum letzten
      Mal 1997 aktualisiert worden ist. Rosegarden-4 ist eine
      vollkommen moderne KDE-Anwendung, und die Version 1.0 wurde 2004
      freigegeben.
      </P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
    Das neue Rosegarden ist eine origini&auml;re KDE-Anwendung, die auf jedem
    System, das die KDE- und QT-Bibliotheken installiert hat,
    lauff&auml;hig ist und zur Zeit mindestens QT/KDE 3.1 ben&ouml;tigt um zu
    laufen. Rosegarden h&auml;ngt von einer Anzahl Bibliotheken und
    architektonischer Eigenschften ab, die man zur Zeit nur unter
    Linux findet. Ein paar tapfere Individuen sind daran interessiert,
    es auf FreeBSD und OS-X zu portieren, aber bis jetzt ist es
    niemandem gelungen und Rosegarden bleibt ausschlie&szlig;liche eine
    Anwendung f&uuml;r Linux.
</P>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
   Rosegarden ben&ouml;tigt mehrere einigerma&szlig;en neue Bibliotheken, damit
      alle Komponenten korrekt arbeiten. Besonders Synth-Plugins
      ben&ouml;tigen eine Bibliothek, die nicht viele Distributionen
      enthielten, w&auml;hrend dies geschrieben wurde. Wenn irgendwas das
      in diesem Buch dokumentiert wird, nicht zu existieren scheint,
      wenden Sie sich an den Administrator, der die
      Distributionspakete verwaltet, mit der Bitte, die erforderlichen
      Bibliotheken aufzunehmen und Rosegarden mit ihnen zu
      kompilieren. Leider würde der der Zusammenbau von Rosegarden aus den
      Quelldateien den Rahmens dieses Buches sprengen.
</P>
	<H2 STYLE="border: none; padding: 0in"><A NAME="1_2"></A>
	Linux-Version 
	</H2>
<P ALIGN=LEFT STYLE="margin-bottom: 0.2in; border: none;
	padding: 0in">
      Je aktuelller die Distribution ist, desto besser. Rosegarden und
      viele verwandte, voneinader abh&auml;ngige Anwendungen sind alle sehr
      neu. Wir bei Rosegarden empfehlen, wenigstens die
      allerneuste Linux-Version einer Distribution ihrer Wahl zu
       verwenden.
      Wir empfehlen weiter, dass eine Distribution mit speziellem
      Schwerpunkt auf Linux-Audio, wie 
     <A HREF="http://www.agnula.org/">AGNULA</A> oder <A HREF="http://ccrma.stanford.edu/planetccrma/software/introduction.html">Planet CCRMA</A>, in
      Betracht gezogen werden sollte, wenn Schwierigkeiten auftauchen,
      alle Komponenten zum Zusammenspiel zu bringen.Linux-Audio ist
      zur Zeit ein etwas geheimnisvolles und komplexes Gebiet und
      diese speziellen Distributionen versuchen dem etwas den Stachel
      zu ziehen. Ich habe auf Anhieb annehmmbare, wenn nicht sogar ideale
      Ergebnisse mit Debian Sarge auf einem schnellen Computer
      erzielt, aber dieses mehr wegen meiner Sturheit als des
      praktischen Nutzens wegen. Ich empfehle w&auml;rmstens den Planet
      oder AGNULA</P> 
	
	<H3 CLASS="western">Ausr&uuml;stung und ben&ouml;tigte Software</H3>
<P>
Viele betreiben Rosegarden erfolgreich auf &auml;lterer, langsamerer
      Hardware. Jedoch kann die CPU nie zu schnell sein und man kann
      nie genug RAM Arbeitsspeicher oder Festplattenspeicher haben. Je
      mehr Resourcen der Computer aufbieten kann, desto erfolgreicher
      kann mit Rosegarden gearbeitet werden. Es folgt eine kurze Liste
      von Grundanforderungen, die befriedigt werden m&uuml;ssen, um
      verschiedene Arbeiten mit Rosegarden ausf&uuml;hren zu k&ouml;nnen.</P>

<UL>
	<P>F&uuml;r MIDI-Aufnahme::</P>
	<UL>
		<LI><P>Ein MIDI-f&auml;higes Keyboard, Gitarre oder andere
	    Ger&auml;te zusammen mit:</P>
		<UL>
			<LI><P>Eine ALSA-unterst&uuml;tzte, sauber
		konfigurierte Hardware-MIDI-Schnittstelle um
		MIDI-Ger&auml;te an den Computer anzuschlie&szlig;en wie:</P>
			<UL>
				<LI><P>Ein Soundkarten-Joystick-Port
		    MIDI-box oder Y-Kabel, und/oder</P>
				<LI><P>oder eine spezielle
		      MIDI-Port-Karte und/oder</P>
				<LI><P>eine USB-MIDI-Schnittstelle</P>
			</UL>
		</UL>
		<LI><P>oder ein Virtuelles Keyboard wie <A HREF="http://packages.debian.org/stable/sound/vkeybd">vkeybd</A></P>
	</UL>
	<P>Zur MIDI-Wiedergabe:</P>
	<UL>
		<LI><P>eine sauber konfigurierte, ALSA-kompatible
	    Soundcarte oder eine MIDI-Schnitstelle, und</P>
		<LI><P>ein externes MIDI-Ger&auml;t wie ein Keyboard oder
	      ein Sound-Modul,
		und/oder</P>
		<LI><P>ein ALSA-unterst&uuml;tzter Hardwaresynthesizer wie
		der Sound Blaster Live! (emu10k1) seine Abk&ouml;mmlinge,
		mit geeignetem und geladenem Soundfont und/oder</P>
		<LI><P>ein ALSA-Softwaresynthesizer, wie QSynth mit
		  dem passenden, geladenen Soundfont (audio-Output
		  &uuml;ber ALSA oder, bevorzugt,	JACK), und/oder</P>
		<LI><P>ein DSSI Synth-Plugin wie FluidSynth-DSSI-plugin, mit
		geeignetem, geladenem Soundfont und/oder den Xsynth-DSSI
		(Analog-Synth&mdash;kein Soundfont erforderlich)-Plugin, von denen jeder einen funktionierenden JACK-Ausgang f&uuml;r Audio-Output ben&ouml;tigt.</P>
	</UL>
	<P>F&uuml;r Audio-Aufnahme:</P>
	<UL>
		<LI><P>einen sauber konfigurierten, laufenden
	    JACK-Server und</P>
		<LI><P>eine JACK-compatible Soundkarte, und</P>
		<LI><P>ein Mikrofon, oder ein oder mehrere Ger&auml;te, die
		Sound erzeugen k&ouml;nne und ihn in einen geeigneten
		Anschlu&szlig; auf der Soundkarte pipen k&ouml;nnen.
		und</P>
		<LI><P>sehr viel Festplattenspeicherplatz</P>
	</UL>
	<P>F&uuml;r Audio-Wiedergabe:</P>
	<UL>
		<LI><P>einen sauber konfigurierten, laufenden JACK-Server, und</P>
		<LI><P>eine JACK-kompatible Soundkarte</P>
	</UL>
</UL>
<H2 CLASS="western" STYLE="border: none; padding: 0in">
<A NAME="1_6"></A>Wie man dieses Dokument bekommt</H2>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in">Die
      HTML-Version <I>Arbeiten mit Rosegarden</I> bekommt man immer
      unter:</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><A HREF="http://rosegarden.sourceforge.net/tutorial/using-rosegarden/using-rosegarden.html">http://rosegarden.sourceforge.net/tutorial/using-rosegarden/
</A>
</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in">Die
      druckbare PDF-Version (formatiert f&uuml;r eine &quot;Universalpapiergr&ouml;&szlig;e&quot;
sollte sowohl mit US-Letter als auch mit DIN A4 funktioneren) findet
      man unter:</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in">Englisch:</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><A
	HREF="http://rosegarden.sourceforge.net/pdf/using-rosegarden.pdf">http://rosegarden.sourceforge.net/pdf/using-rosegarden.pdf</A></P>
<H2 CLASS="western" STYLE="border: none; padding: 0in"><A NAME="1_8"></A>
&Uuml;bersetzungen</H2>
<TABLE WIDTH=100% BORDER=0 CELLPADDING=0 CELLSPACING=0>
	<COL WIDTH=128*>
	<COL WIDTH=128*>
	<TR VALIGN=TOP>
		<TD WIDTH=50%>
			<P>Deutsch</P>
		</TD>
		<TD WIDTH=50%>
			<P STYLE="border: none; padding: 0in">Bernd Weber
			&lt;<A HREF="mailto:weber.freiburg@freenet.de">weber.freiburg@freenet.de</A>&gt;</P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=50%>
			<P>Spanisch</P>
		</TD>
		<TD WIDTH=50%>
			<P>D. Michael McIntyre and ??? (&Uuml;bersetzung
		ist in Arbeit, aber sie geht langsam voran und ich
		sollte sie wirklich einem Muttersprachler &uuml;bergeben.)</P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=50%>
			<P>Russisch</P>
		</TD>
		<TD WIDTH=50%>
			<P>Alexandre Prokoudine &lt;alexandre.prokoudine@gmail.com&gt;</P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=50%>
			<P>TBA</P>
		</TD>
		<TD WIDTH=50%>
			<P>tba</P>
		</TD>
	</TR>
	<TR VALIGN=TOP>
		<TD WIDTH=50%>
			<P>TBA</P>
		</TD>
		<TD WIDTH=50%>
			<P>tba</P>
		</TD>
	</TR>
</TABLE>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><BR><BR>
</P>
<H2 CLASS="western">Danksagung</H2>
<P>Dank geb&uuml;hrt folgenden...</P>
<P>Chris Cannam, Rich Bown, Guillaume Laurent &ndash; daf&uuml;r, mir etwas
      zu schreiben zu geben,und mir an einigen Punkten weitergeholfen
      zu haben</P>
<P>Shelagh, Daniel Krippner &ndash; daf&uuml;r, mich darin zu best&auml;rken,
      da&szlig; das ganze den Leuten wirklich von Nutzen ist</P>
<P>Pedro Lopez-Cabanillas &ndash; f&uuml;r Informationen &uuml;ber USB-MIDI und Sysex</P>
<P>Brendon Oliver &ndash; f&uuml;r etwas Perl-Magie um mein
      Dokumentenaufbausystem zu verbessern</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><BR><BR>
</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><BR><BR>
</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><BR><BR>
</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><BR><BR>
</P>
<P STYLE="margin-bottom: 0.2in; border: none; padding: 0in"><BR><BR>
</P>
</BODY>
</HTML>
