Repository: nengxu/rosegarden
Catalog: po/*.po
Languages: de

source: Tempo is fixed until the following tempo change
de: Tempo ist bis zur nächsten Tempoänderung fixiert

source: Tempo ramps to the following tempo
de: Tempo gleitet ins nächte Tempo über

source: Tempo ramps to:
de: Tempo gleitet über nach:

source: Time of tempo change
de: Zeit der Tempoänderung

source: The pointer is currently at
de: Der Zeiger ist zur Zeit bei

source: Apply this tempo from here onwards
de: Dieses Tempo ab hier anwenden

source: Replace the last tempo change
de: Die letzte Tempoänderung ersetzen

source: Apply this tempo from the start of this bar
de: Dieses Tempo ab Beginn dieses Taktes anwenden

source: Apply this tempo to the whole composition
de: Dieses Tempo auf das ganze Stück anwenden

source: Also make this the default tempo
de: Dieses Tempo auch zum Standard machen

source: at the start of measure %1.
de: am Beginn von Takt %1.

source: in the middle of measure %1.
de: in der Mitte von Takt %1.

source: (at %1.%2 s, in measure %3)
de: (bei %1.%2 s, in Takt %3)

source: There are no preceding tempo changes.
de: Es gibt keine vorherigen Tempoveränderungen

source: There are no other tempo changes.
de: Es gibt keine anderen Tempoveränderungen.

source: Playing audio file
de: Audiodatei wird abgespielt

source: Playing audio file "%1"
de: Audiodatei "%1" wird abgespielt

source: Trigger Segment
de: Getriggertes Segment

source: Trigger segment:
de: Getriggertes Segment

source: Key Change
de: Tonart-Veränderung

source: Key signature
de: Tonart

source: Key transposition
de: Tonart transponieren

source: Existing notes following key change
de: Vorhandene Noten folgen der Tonart-Veränderung

source: Flatten
de: Erniedrigen

source: Key
de: Tonart

source: Sharpen
de: Erhöhen

source: Major
de: dur

source: Minor
de: moll

source: Transpose key according to segment transposition
de: Transponiere die Tonart gemäß der Segment Transposition

source: Use specified key. Do not transpose
de: Verwende die angegebene Tonart. Transponiere nicht

source: Apply to current segment only
de: Nur auf aktuelles Segment anwenden

source: Apply to all segments at this time
de: Auf alle Segmente zu diesem Zeitpunkt anwenden

source: Maintain current accidentals
de: Aktuelle Vorzeichen beibehalten

source: Transpose into this key
de: In diese Tonart transponieren

source: No such key
de: Tonart nicht vorhanden

source: Interpretations to apply
de: Anzuwendende Interpretationen

source: Apply text dynamics (p, mf, ff etc)
de: Dynamik-Vortragszeichen anwenden (p, mf, ff etc.)

source: Apply hairpin dynamics
de: Crescendo / Decrescendo anwenden

source: Stress beats
de: Taktschläge betonen

source: Articulate slurs, staccato, tenuto etc
de: Bögen, Staccato, Tenuto artikulieren

source: All available interpretations
de: All verfübaren Interpretationen

source: Starting sequencer...
de: Sequenzer wird gestartet...

source: Initializing plugin manager...
de: Plugin Manager wird initialisiert...

source: Initializing view...
de: Ansicht wird initialisiert...

source: Special Parameters
de: Spezielle Parameter

source: Starting sequence manager...
de: Sequenz-Manager wird gestartet...

source: Clearing studio data...
de: Studio-Daten werden gelöscht...

source: Starting...
de: Beginn...

source: Import Rosegarden &Project file...
de: Rosegarden &Projekt-Datei importieren...

source: Import &MIDI file...
de: &MIDI-Datei importieren...

source: Import &Rosegarden 2.1 file...
de: &Rosegarden-2.1-Datei importieren...

source: Import &Hydrogen file...
de: &Hydrogen-Datei importieren...

source: Merge &File...
de: Datei mischen...

source: Merge &MIDI file...
de: &MIDI-Datei mischen...

source: Merge &Rosegarden 2.1 file...
de: &Rosegarden 2.1-Datei mischen...

source: Merge &Hydrogen file...
de: &Hydrogen-Datei mischen...

source: Export Rosegarden &Project file...
de: Rosegarden &Projekt-Datei exportieren...

source: Export &MIDI file...
de: &MIDI-Datei exportieren...

source: Export Music&XML file...
de: Music&XML-Datei exportieren...

source: Export &Csound score file...
de: &Csound-Datei exportieren...

source: Export M&up file...
de: M&up-Datei exportieren...

source: Preview with Lil&yPond...
de: Vorschau mit Lil&yPond...

source: Play&list
de: Wiedergabe Liste

source: &Bug Reporting Guidelines
de: Richtlinien für Fehlerberichte

source: Und&o
de: &Rückgängig

source: Re&do
de: &Wiederholen

source: Show T&ools Toolbar
de: &Werkzeug-Werkzeugleiste anzeigen

source: Show Trac&ks Toolbar
de: &Spuren-Werkzeugleiste anzeigen

source: Show &Editors Toolbar
de: &Editor-Werkzeugleiste anzeigen

source: Show Trans&port Toolbar
de: &Bedienfeld-Werkzeugleiste anzeigen

source: Show &Zoom Toolbar
de: &Zoom-Werkzeugleiste anzeigen

source: Show Tra&nsport
de: Bedienfeld anzeigen

source: Show Track &Labels
de: Tonspur-&Labels anzeigen

source: Show Playback Position R&uler
de: Wiedegabepositionslineal anzeigen

source: Show Te&mpo Ruler
de: Te&mpolineal anzeigen

source: Show Cho&rd Name Ruler
de: Ak&kordnamenlineal anzeigen

source: Show Segment Pre&views
de: Segment-&Vorschauen anzeigen

source: Show Special &Parameters
de: Spezielle Parameter anzeigen

source: &Select and Edit
de: Aus&wählen und editieren

source: &Draw
de: &Zeichnen

source: &Erase
de: &Löschen

source: &Move
de: &Bewegen

source: &Resize
de: &Größe verändern

source: &Split
de: Auf&teilen

source: &Join
de: &Verbinden

source: &Harmonize
de: &Harmonisieren

source: Open Tempo and Time Signature Editor
de: Tempo- und Taktarteditor öffnen

source: Cut Range
de: Bereich schneiden

source: Copy Range
de: Bereich kopieren

source: Paste Range
de: Bereich einfügen

source: Insert Range...
de: Leeren Bereich einfügen...

source: De&lete
de: &Löschen

source: Select &All Segments
de: &Alle Segmente auswählen

source: Edit Mar&kers...
de: Mar&ker editieren...

source: Edit Document P&roperties...
de: &Dokumenteigenschaften bearbeiten...

source: Open in &Default Editor
de: Im &Standardeditor öffnen

source: Open in Matri&x Editor
de: Im &Matrixeditor öffnen

source: Open in &Percussion Matrix Editor
de: Im &Percussion Matrix Editor öffnen

source: Open in &Notation Editor
de: Im &Notationseditor öffnen

source: Open in &Event List Editor
de: Im &Evenlisteneditor öffnen

source: &Quantize...
de: Quantisieren...

source: Repeat Last Quantize
de: Letzte Quantisierung wiederholen

source: Split at Time...
de: Am Zeitpunkt aufteilen...

source: Jog &Left
de: Jog nach &links

source: Jog &Right
de: Jog nach &rechts

source: Set Start Time...
de: Anfangszeit setzen...

source: Set Duration...
de: Dauer festlegen ...

source: Turn Re&peats into Copies
de: &Wiederholungen in Kopien umwandeln

source: Manage Tri&ggered Segments
de: Getri&ggerte Segmente verwalten

source: Set Tempos from &Beat Segment
de: Tempi vom Beat-Segment setzen

source: Set &Tempo to Audio Segment Duration
de: &Tempo auf Audiosegmentdauer setzen

source: Manage A&udio Files
de: A&udiodateien verwalten

source: Show Segment Labels
de: Zeige Segment-Label

source: Add &Track
de: Spur hinzufügen...

source: &Add Tracks...
de: Mehrere Spuren hinzufügen...

source: D&elete Track
de: Spur &löschen

source: Move Track &Down
de: Spur nach &unten bewegen

source: Move Track &Up
de: Spur nach &oben bewegen

source: Select &Next Track
de: &Nächste Spur auswählen

source: Select &Previous Track
de: &Vorherige Spur auswählen

source: Mute or Unmute Track
de: Spur stummschalten oder lautschalten

source: Arm or Un-arm Track for Record
de: Ausgewählten Track für Aufnahmen verwenden: an/aus

source: &Mute all Tracks
de: Alle Spuren stumm

source: &Unmute all Tracks
de: Alle Spuren an

source: &Remap Instruments...
de: Instrumente &neu zuordnen...

source: Manage MIDI &Devices
de: MIDI-Geräte verwalten...

source: Manage S&ynth Plugins
de: S&ynth Plugins verwalten

source: Modify MIDI &Filters
de: MIDI-&Filter ändern...

source: Manage &Metronome
de: Verwalte &Metronom

source: &Save Current Document as Default Studio
de: Aktuelles Dokument als &Standardstudio speichern

source: &Import Default Studio
de: &Importiere Standardstudio

source: Im&port Studio from File...
de: Im&portiereStudio aus Datei...

source: &Reset MIDI Network
de: MIDI Netzwerk zu&rücksetzen

source: Set Quick Marker at Playback Position
de: Setze eine Markierung an der Wiedergabeposition

source: Jump to Quick Marker
de: Springe zur Markierung

source: &Play
de: &Wiedergabe

source: &Fast Forward
de: &Vorspulen

source: Re&wind
de: &Zurückspulen

source: P&unch in Record
de: P&unch-In-Aufnahme

source: &Record
de: &Aufnehmen

source: Rewind to &Beginning
de: Zum &Anfang spulen

source: Fast Forward to &End
de: Zum &Ende spulen

source: Scro&ll to Follow Playback
de: Ansicht fo&lgt der Wiedergabe

source: Panic
de: Panik

source: File "%1" does not exist
de: Die Datei "%1" existiert nicht

source: File "%1" is actually a directory
de: Die Datei "%1" ist ein Verzeichnis

source: You do not have read permission for "%1"
de: Sie haben für diese Datei keinen Lesezugriff.

source: An auto-save file for this document has been found Do you want to open it instead ?
de: Es wurde eine automatische Sicherung für diese Datei gefunden. Wollen Sie diese stattdessen öffnen?

source: Example Files
de: Beispiel Dateien

source: Opening a new application window...
de: Neues Anwendungsfenster öffnen...

source: Creating new document...
de: Neues Dokument erzeugen...

source: Malformed URL %1
de: Formal falsche URL %1

source: Opening file...
de: Datei öffnen...

source: Open File
de: Datei öffnen

source: Saving file...
de: Datei speichern...

source: This is not a valid filename.
de: Dies ist kein gültiger Dateiname.

source: This is not a local file.
de: Dies ist keine lokale Datei.

source: You have specified a directory
de: Sie haben ein Verzeichnis angegeben

source: The specified file exists. Overwrite?
de: Die angegebene Datei existiert schon. Überschreiben?

source: Saving file with a new filename...
de: Datei wird mit neuem Namen gespeichert...

source: All files
de: Alle Dateien

source: Save as...
de: Speichern unter...

source: Closing file...
de: Datei wird geschlossen...

source: Printing...
de: Drucken...

source: Previewing...
de: Vorschau...

source: Exiting...
de: Programm wird beendet...

source: Cutting selection...
de: Auswahl wird ausgeschnitten...

source: Copying selection to clipboard...
de: Auswahl in die Zwischenablage kopieren...

source: Clipboard is empty
de: Die Zwischenablage ist leer

source: Inserting clipboard contents...
de: Inhalt der Zwischenablage einfügen...

source: Duration of empty range to insert
de: Dauer des leeren Bereiches zum einfügen

source: This function needs no more than one segment to be selected.
de: Für diese Funktion darf nur ein einziges Segment ausgewählt sein.

source: Can't join Audio segments
de: Audio-Segmente können nicht zusammengefasst werden

source: rescaling an audio file
de: Verändere die Größe der Audiodatei (neu-Skalierung)

source: Rescaling audio file...
de: Länge einer Audiodatei verändern (neu-skalieren)...

source: Set audio file path
de: Pfad für Audiodateien

source: Jog Selection
de: Auswahl joggen

source: Segment Start Time
de: Segment Anfangszeit

source: Set Segment Start Times
de: Segment Anfangszeiten setzen

source: Set Segment Start Time
de: Segment Anfangszeit setzen

source: Segment Duration
de: Segment Dauer

source: Set Segment Durations
de: Segmentlängen setzen

source: Set Segment Duration
de: Segment Dauer setzen

source: Set Global Tempo
de: Globales Tempe setzen

source: Toggle the toolbar...
de: Toolbar umschalten...

source: Toggle the tools toolbar...
de: Werkzeug-Werkzeugleiste umschalten...

source: Toggle the tracks toolbar...
de: Spur-Toolbar umschalten...

source: Toggle the editor toolbar...
de: Editor-Toolbar umschalten...

source: Toggle the transport toolbar...
de: Bedienfeld-Werkzeugleiste umschalten...

source: Toggle the zoom toolbar...
de: Zoom-Werkzeugleiste umschalten...

source: Toggle the Transport
de: Bedienfeld umschalten

source: Toggle the statusbar...
de: Statuszeile umschalten...

source: The join tool isn't implemented yet. Instead please highlight the segments you want to join and then use the menu option: Segments->Collapse Segments.
de: Das Verbinden-Werkzeug ist noch nicht programmiert. Bitte markieren Sie stattdessen die Segmente, die Sie verbinden wollen und benutzen dann die Menüoption:\n Segmente->Segmente zusammenfassen.

source: Join tool not yet implemented
de: Das Verbinden-Werkzeug ist noch nicht fertig.

source: Revert modified document to previous saved version?
de: Geändertes Dokument auf vorher gespeicherte Version zurücksetzen?

source: *.rgp|Rosegarden Project files *|All files
de: *.rgp|Rosegarden Projekt Dateien *|Alle Dateien

source: Import Rosegarden Project File
de: Rosegarden Projekt-Datei importieren

source: Failed to import project file "%1"
de: Import der Projektdatei "%1" fehlgeschlagen

source: Open MIDI File
de: MIDI-Datei öffnen

source: Merge MIDI File
de: MIDI-Datei mischen

source: Importing MIDI file...
de: MIDI-Datei wird importiert...

source: Calculating notation...
de: Notation wird berechnet...

source: Calculate Notation
de: Notation errechnen

source: *.rose|Rosegarden-2 files *|All files
de: *.rose|Rosegarden-2 Dateien *|Alle Dateien

source: Open Rosegarden 2.1 File
de: Rosegarden 2.1-Datei öffnen

source: Importing Rosegarden 2.1 file...
de: Rosegarden.2.1-Datei wird importiert...

source: Can't load Rosegarden 2.1 file. It appears to be corrupted.
de: Diese Rosegarden-2.1-Datei kann nicht geladen werden. Sie scheint beschädigt zu sein.

source: *.h2song|Hydrogen files *|All files
de: *.h2song|Hydrogen Dateien *|Alle Dateien

source: Open Hydrogen File
de: Hydrogen Datei öffnen

source: Importing Hydrogen file...
de: Hydrogen Datei wird importiert...

source: Can't load Hydrogen file. It appears to be corrupted.
de: Diese Hydrogen Datei kann nicht geladen werden. Sie scheint beschädigt zu sein.

source: Export and import of Rosegarden Project files
de: Export und Import von Rosegarden Projektdateien...

source: <h3>Helper programs not found</h3><p>Rosegarden could not find one or more helper programs which it needs to provide some features. The following features will not be available:</p>
de: <h3>Hilfsprogramme nicht gefunden</h3><p>Rosegarden konnte ein oder einige Hilfsprogramme nicht finden, welche für manche Funktionen benötigt werden. Die folgenden Funktionen werden nicht möglich sein:</p>

source: <p>To fix this, you should install the following additional programs:</p>
de: <p>Um dieses zu berichtigen, sollten Sie folgende Programme zusätzlich installieren:</p>

source: Helper programs not found
de: Hilfsprogramme wurden nicht gefunden

source: Starting the sequencer...
de: Sequencer wird gestartet...

source: Couldn't start the sequencer
de: Sequencer konnte nicht gestartet werden

source: Clearing down jackd...
de: jackd wird heruntergefahren...

source: Starting jackd...
de: jackd wird gestartet...

source: The Rosegarden sequencer process has exited unexpectedly. Sound and recording will no longer be available for this session. Please exit and restart Rosegarden to restore sound capability.
de: Der Rosegarden Sequenzer Process ist unerwartet abgebrochen. Aufnahme und Wiedergabe stehen in dieser Sitzung nicht mehr zur Verfügung. Bitte Beenden und erneut Starten, damit der Ton wieder funktioniert.

source: The Rosegarden sequencer could not be started, so sound and recording will be unavailable for this session. For assistance with correct audio and MIDI configuration, go to http://rosegardenmusic.com.
de: Der Rosegarden Sequenzer konnte nicht gestartet werden. Damit stehen Aufnahme und Wiedergabe in dieser Sitzung nicht zur Verfügung. Für Hilfestellung bei den Audio und MIDI-Einstellungen gehe nach http://rosegardenmusic.com.

source: Exporting Rosegarden Project file...
de: Rosegarden Projekt Datei wird importiert...

source: Rosegarden Project files
de: Rosegarde Projekt Dateien

source: Export as...
de: Exportieren als...

source: Saving Rosegarden file to package failed: %1
de: Speichern der Rosegarden-Datei beim Komprimieren fehlgeschlagen: %1

source: Failed to export to project file "%1"
de: Export der Projekt-Datei "%1" fehlgeschlagen

source: Exporting MIDI file...
de: MIDI-Datei wird exportiert...

source: Standard MIDI files
de: Standard-MIDI-Dateien

source: Export failed. The file could not be opened for writing.
de: Der Export ist fehlgeschlagen. Die Datei konnte nicht zum Schreiben geöffnet werden.

source: Exporting Csound score file...
de: Csound-Partitur-Datei wird exportiert...

source: Exporting Mup file...
de: Mup-Datei wird exportiert...

source: Mup files
de: Mup-Dateien

source: Exporting MusicXML file...
de: MusicXML-Datei wird exportiert...

source: XML files
de: XML-Dateien

source: The audio file path does not exist or is not writable. Please set the audio file path to a valid directory in Document Properties before recording audio. Would you like to set it now?
de: Der angegebene Audio-Dateipfad existiert entweder nicht oder ist nicht schreibbar. Bitte setzen Sie den Audio-Dateipfad auf ein gültiges Verzeichnis in dem Dokumenteigenschaften bevor Sie Audio aufnehmen. Möchten Sie den Pfad jetzt setzen?

source: The audio file path does not exist or is not writable. Please set the audio file path to a valid directory in Document Properties before you start to record audio. Would you like to set it now?
de: Der angegebene Audio-Dateipfad existiert entweder nicht oder ist nicht schreibbar. Bitte setzen Sie den Audio-Dateipfad auf ein gültiges Verzeichnis in dem Dokumenteigenschaften bevor Sie Audio aufnehmen. Möchten Sie den Pfad jetzt setzen?

source: Move playback pointer to time
de: Wiedergabezeiger zu einer &Zeit bewegen

source: Replace Tempo Change at %1
de: Tempoveränderung ersetzen bei %1

source: Set Global and Default Tempo
de: Globales und Standard-Tempo setzen

source: Move Tempo Change
de: &Tempoveränderung verschieben...

source: new marker
de: Neue Markierung

source: no description
de: Keine Beschreibung

source: Sequencer failed to add audio file %1
de: Der Sequenzer konnte die Audio-Datei %1 nicht hinzufügen

source: Sequencer failed to remove audio file id %1
de: Der Sequenzer konnte die Audio-Datei %1 nicht entfernen

source: Modify Segment label
de: Segmentbezeichnung ändern

source: Modify Segments label
de: Segmentbezeichnungen ändern

source: Relabelling selection...
de: Auswahl umbenennen...

source: Play List
de: Liste Abspielen

source: Queueing MIDI panic events for tranmission...
de: MIDI Oanik Event in Transmissionswarteschlange eingestellt....

source: Are you sure you want to save this as your default studio?
de: Sind Sie sicher, dass Sie dies als Ihr Standardstudio speichern wollen?

source: Saving current document as default studio...
de: Aktuelles Dokument wird als Standartstudio gespeichert...

source: Are you sure you want to import your default studio and lose the current one?
de: Sind Sie sicher dass Sie Ihr Standardstudio importieren und dabei das Aktuelle überschreiben wollen?

source: Import Studio from File
de: Studio aus Datei importieren

source: Import Studio
de: Studio importieren

source: <h3>Newer version available</h3><p>A newer version of Rosegarden may be available.<br>Please consult the <a href="http://www.rosegardenmusic.com/getting/">Rosegarden website</a> for more information.</p>
de: <h3>Neue Version erhältlich !</h3><p>Eine neuere Version von Rosegarden ist offenbar erhältlich. <br>Bitte besuchen Sie die <a href="http://www.rosegardenmusic.com/getting/">Rosegarden Website</a> für mehr Information.</p>

source: Newer version available
de: Eine neuere Version ist verfügbar

source: Failed to load soundfont %1
de: Laden von Soundfont nicht gelungen: %1

source: Rosegarden - A sequencer and musical notation editor
de: Rosegarden - ein Sequenzer und Notationseditor

source: Don't use the sequencer (support editing only)
de: Sequenzer nicht verwenden (nur editieren möglich)

source: Don't show the splash screen
de: Kein Startbild

source: Don't automatically run in the background
de: Laufe nicht automatisch im Hintergrund

source: Attach to a running sequencer process, if found
de: In einen laufenden Sequenzer einklicken, falls vorhanden

source: Ignore installed version - for devs only
de: Ignoriere installierte Version - nur für Entwickler

source: file to open
de: zu öffnende Datei

source: Installation contains the wrong version of Rosegarden.
de: Die Installation enthält die falsche Rosegarden-Version.

source: Installation problem
de: Installationsproblem

source: Rosegarden does not appear to have been installed.
de: Rosegarden scheint nicht installiert worden zu sein.

source: UI improvements bug fixes
de: UI Verbesserungen Fehlerbeseitigung

source: Segment colours Other UI and bug fixes
de: Segmentfarben Andere UI und sonstige Fehler beseitigt

source: Russian translation i18n-ization
de: Russische Übersetzung i18n-ization

source: German translation
de: Deutsche Übersetzung

source: Welsh translation
de: Walisische Übersetzung

source: French translation
de: Französische Übersetzung

source: Italian translation
de: Italienische Übersetzung

source: Swedish translation
de: Schwedische Übersetzung

source: Estonian translation
de: Estnische Übersetzung

source: Dutch translation
de: Niederländische Übersetzung

source: Transposition by interval
de: Transposition um ein Interval

source: Original designs for rotary controllers
de: Ursprüngliches Design der Drehknöfpe

source: Japanese translation
de: Japanische Übersetzung

source: Auto-scroll deceleration Rests outside staves and other bug fixes
de: Autoscroll Abbremsung Pausen ausserhalb von Systemen und andere Fehlerbeseitigung

source: Simplified Chinese translation
de: Übersetzung in vereinfachtes Chinesisch

source: LIRC infrared remote-controller support
de: Unterstützung für LIRC Infrarot Fernsteuerung

source: MTC slave timing implementation
de: MTC-Slave Timing Implementierung

source: Czech translation
de: Tschechische Übersetzung

source: SCons/bksys building system
de: SCons/bksys Buildsystem

source: Spanish translation
de: Spanische Übersetzung

source: Catalan translation
de: Katalanische Übersetzung

source: _: NAME OF TRANSLATORS Your names
de: Namen der Übersetzer:, Emanuel Rumpf 2008-04-28 2008-08-22, Michael Gerdau 2006, Eckhard Jokisch 2005, Jörg Schumann 2003,

source: _: EMAIL OF TRANSLATORS Your emails
de: , , mgd@technosis.de, e.jokisch@u-code.de, ,

source: Welcome!
de: Willkommen!
