Repository: nengxu/rosegarden
Catalog: po/*.po
Languages: de

source: <h2>Welcome to Rosegarden!</h2><p>Welcome to the Rosegarden audio and MIDI sequencer and musical notation editor.</p><ul><li>If you have not already done so, you may wish to install some DSSI synth plugins, or a separate synth program such as QSynth. Rosegarden does not synthesize sounds from MIDI on its own, so without these you will hear nothing.</li><br><br><li>Rosegarden uses the JACK audio server for recording and playback of audio, and for playback from DSSI synth plugins. These features will only be available if the JACK server is running.</li><br><br><li>Rosegarden has comprehensive documentation: see the Help menu for the handbook, tutorials, and other information!</li></ul><p>Rosegarden was brought to you by a team of volunteers across the world. To learn more, go to <a href="http://www.rosegardenmusic.com/">http://www.rosegardenmusic.com/</a>.</p>
de: <h2>Willkommen bei Rosegarden!</h2><p>Dem Audio- und MIDI- Sequenzer und musikalischen Notationseditor.</p><ul><li>Wenn Sie es nicht bereits getan haben, dann sollten Sie einige 'DSSI synth plugins' installieren, oder ein eigenständiges Synthese-Program wie z.B. QSynth. Rosegarden hat selbst kein solches Synthese-/Klangmodul für MIDI, so dass Sie ohne ein Zusätzliches nichts hören werden ! </li><br><br><li>Rosegarden verwendet den 'JACK audio server' für Aufnahme und Wiedergabe von Audio, und für das Abspielen von 'DSSI synth plugins'. Diese Funktionen können also nur genutzt werden, wenn der 'JACK audio server' läuft.</li><br><br><li>Rosegarden hat eine umfassende Dokumentation: sehen Sie in das Hilfsmenü für Handbücher, Anleitungen und andere Information!</li></ul><p>Rosegarden wurde von einer Gruppe aus Freiwilligen auf der ganzen Welt entwickelt. Um mehr zu lernen, gehen Sie zu: <a href="http://www.rosegardenmusic.com/">http://www.rosegardenmusic. com/</a>.</p>

source: No non-audio segments in composition
de: Keine Nicht-Audiosegmente in diesem Stück.

source: Selection must contain only audio or non-audio segments
de: Die Auswahl darf nur Audio- oder Nichtaudiosegmente enthalten

source: No non-audio segments selected
de: Keine Nichtaudiosegmente ausgeählt

source: Can't add dropped file.
de: Kann entfernte Datei nicht hinzufügen.

source: The JACK Audio subsystem has failed or it has stopped Rosegarden from processing audio. Please restart Rosegarden to continue working with audio. Quitting other running applications may improve Rosegarden's performance.
de: Das JACK Audio Subsystem hat eine Fehler gemeldet oder Rosegarden anderweitig an der Verarbeitung von Audio gehindert. Bitte starten Sie Rosegarden erneut, wenn Sie mit Audio weiterarbeiten möchten. Das Beenden anderer laufender Anwendung könnte u.U. die Leistung von Rosegarden verbessern.

source: The JACK Audio subsystem has stopped Rosegarden from processing audio, probably because of a processing overload. An attempt to restart the audio service has been made, but some problems may remain. Quitting other running applications may improve Rosegarden's performance.
de: Das JACK Audio Subsystem hat eine Fehler gemeldet oder Rosegarden anderweitig an der Verarbeitung von Audio gehindert, möglicherweise wegen Überlastung. Der Audiodienst wurde neu gestartet, aber ev. sind damit nicht alle Probleme behoben. Das Beenden anderer laufender Anwendung könnte u.U. die Leistung von Rosegarden verbessern.

source: Run out of processor power for real-time audio processing. Cannot continue.
de: Es steht nicht geügend CPU-Leistung für die Echtzeit Audiobearbeitung zur Verfügung. Kann nicht fortfahren.

source: A serious error has occurred in the ALSA MIDI subsystem. It may not be possible to continue sequencing. Please check console output for more information.
de: Im ALSA MIDI Subsystem ist ein schwerer Fehler aufgetreten. Es könnte sein, dass weiteres Sequenzing nicht möglich ist. Auf der Konsole finden Sie vielleicht weitergehende Informationen.

source: JACK Audio subsystem is losing sample frames.
de: Das JACK Audio Subsystem verliert Sampleframes.

source: Failed to read audio data from disc in time to service the audio subsystem.
de: Audiodaten konnten nicht an das Audio Subsystem weiterleitet werden, da sie nicht schnell genug von der Platte gelesen wurden.

source: Failed to write audio data to disc fast enough to service the audio subsystem.
de: Audiodaten konnten nicht vom Audio Subsystem angenommen werden, da sie nicht schnell genug auf die Platte geschrieben wurden.

source: The audio mixing subsystem is failing to keep up.
de: Das Audio Mixer Subsystem kommt nicht mit (ist zu langsam).

source: The audio subsystem is failing to keep up.
de: Das Audio Subsystem kommt nicht mit (ist zu langsam).

source: Unknown sequencer failure mode!
de: Unbekannter Sequenzer Fehlermodus!

source: <h3>Sequencer startup failed</h3>%1
de: <h3>Sequenzerstart fehlgeschlagen:</h3> %1

source: <h3>Failed to connect to JACK audio server.</h3><p>Rosegarden could not connect to the JACK audio server. This probably means the JACK server is not running.</p><p>If you want to be able to play or record audio files or use plugins, you should exit Rosegarden and start the JACK server before running Rosegarden again.</p>
de: <h3>Konnte nicht zum 'JACK audio server' verbinden.</h3><p>Rosegarden konnte sich nicht mit dem 'JACK audio server' verbinden. Das bedeutet vermutlich, dass der 'JACK server' nicht läuft.</p><p>Wenn Sie Audiodateien aufnehmen oder wiedergeben, oder plugins verwenden möchten, dann sollten Sie Rosegarden schliessen und den 'JACK server' starten, bevor Sie Rosegarden erneut starten.</p>

source: Failed to connect to JACK
de: Konnte nicht zum 'JACK audio server' verbinden

source: Modify MIDI filters...
de: MIDI-Filter ändern...

source: THRU events to ignore
de: THRU-Events, die ignoriert werden sollen

source: Program Change
de: Programmwechsel

source: RECORD events to ignore
de: RECORD-Events, die ignoriert werden sollen

source: Note:
de: Notiz:

source: <inexact>
de: <ungenau>

source: Units:
de: Einheiten:

source: Time:
de: Zeit:

source: units
de: Einheiten

source: Measures:
de: Takte:

source: Measure:
de: Takt:

source: beats:
de: Schläge:

source: beat:
de: Schlag:

source: Seconds:
de: Sekunden:

source: (%1/%2 time)
de: (%1/%2 Zeit)

source: (starting %1.%2 qpm, %2.%3 bpm)
de: (beginnt bei %1.%2 qpm, %2.%3 bpm)

source: (starting %1.%2 bpm)
de: (beginnt bei %1.%2 bpm)

source: Sub %1
de: Gruppe %1

source: Sub %1 R
de: Gruppe %1 R

source: Sub %1 L
de: Gruppe %1 L

source: Audio plugin button
de: Audio-Plugin-Knopf

source: <no synth>
de: <kein Synth>

source: Synth plugin button
de: Synth-Plugin Knopf

source: Set the audio pan position in the stereo field
de: Die Audio-Hörposition im Stereofeld setzen

source: Open synth plugin's native editor
de: Den eigenen Editor des Synth-Plugins öffnen

source: Mono or Stereo Instrument
de: Audio-Instrument in Mono oder Stereo

source: Record level
de: Aufnahmelautstärke =

source: Playback level
de: Wiedergabelautstärke =

source: Audio level
de: Audiodatei hinzufügen

source: Processing...
de: Verarbeitung...

source: Color
de: Farbe

source: Modify Color Name
de: Farbname verändern

source: Enter new name
de: Neuen Namen eingeben

source: Default Color
de: Standardfarbe

source: Click and drag up and down or left and right to modify. Double click to edit value directly.
de: Klicken und Ziehen. auf und ab oder von links nach rechts, um den Wert zu verändern.

source: Select a new value
de: Neuen Wert wählen

source: Enter a new value
de: Neuen Wert eingeben

source: Quantizer
de: Quantisierer

source: Quantizer type:
de: Quantisiererungstyp

source: Grid quantizer
de: Raster-Quantisierer

source: Legato quantizer
de: Legato Quantisierer

source: Heuristic notation quantizer
de: Heuristischer Notationsquantisierer

source: Quantize for notation only (leave performance unchanged)
de: Quantisieren nur für die Notation (die Darbietung unverändert lassen)

source: Notation parameters
de: Notationsparameter

source: Base grid unit:
de: Basis-Rastereinheit:

source: Complexity:
de: Komplexität:

source: Very high
de: Sehr hoch

source: High
de: Hoch

source: Low
de: Niedrig

source: Very low
de: Sehr niedrig

source: Tuplet level:
de: Tuolenebene:

source: 2-in-the-time-of-3
de: 2-auf-3

source: Triplet
de: Triole

source: Any
de: Irgendein

source: Permit counterpoint
de: Kontrapunkt erlauben

source: Grid parameters
de: Rasterparameter

source: Iterative amount:
de: Iterativer Anteil

source: Quantize durations as well as start times
de: Sowohl Dauern als auch Startzeiten quantisieren

source: After quantization
de: Nach Quantisierung

source: Show advanced options
de: Experteneinstellungen

source: Re-beam
de: Wieder Balken hinzufügen

source: Add articulations (staccato, tenuto, slurs)
de: Artikulation hinzufügen (staccato, tenuto, Bögen)

source: Tie notes at barlines etc
de: Noten an Taktstrichen verbinden etc.

source: Split-and-tie overlapping chords
de: Überlappende Akkorde aufteilen und verbinden

source: Full quantize
de: Vollständiges Quantisieren

source: Show Advanced Options
de: Experteneinstellungen

source: Hide Advanced Options
de: Experteneinstellungen verstecken

source: Title
de: Titel

source: Subtitle
de: Untertitel

source: Composer
de: Komponist

source: Arranger
de: Arrangiert

source: Add New Property
de: Neue Eigenschaft hinzufügen

source: Delete Property
de: Eigenschaft löschen

source: {new property %1}
de: {neue Eigenschaft %1}

source: {new property}
de: {neue Eigenschaft}

source: {undefined}
de: {undefiniert}

source: Double-click opens segment in
de: Default-Editor (bei Doppelklick auf ein Segment)

source: Notation editor
de: im Notationseditor öffnen

source: Matrix editor
de: im Matrixeditor öffnen

source: Event List editor
de: im Evenlisteneditor öffnen

source: Number of count-in measures when recording
de: Anzahl vorzuzählender Takte bei Aufnahmen

source: Every 30 seconds
de: Alle 30 Sekunden

source: Every minute
de: Jede Minute

source: Every five minutes
de: Alle fünf Minuten

source: Every half an hour
de: Jede halbe Stunde

source: Never
de: Niemals

source: Append suffixes to segment labels
de: Anhängen von Suffixen an die Segment-Beschriftung

source: Use JACK transport
de: Verwende den JACK Transportmodus

source: Unknown
de: Unbekannt

source: No MIDI, audio OK
de: Kein MIDI, aber Audio

source: MIDI OK, no audio
de: MIDI, aber kein Audio

source: MIDI OK, audio OK
de: MID und Audio OK

source: No driver
de: Kein Treiber

source: Details...
de: Zeige Detailinformationen...

source: Behavior
de: Verhalten

source: Side-bar parameter box layout
de: Anordnung der Parameter-Boxen in der Seitenleiste (box layout)

source: Vertically stacked
de: Übereinander

source: Tabbed
de: Mit Tabs (wie Karteikarten)

source: Note name style
de: Notennamenstil

source: Localized (where available)
de: Lokalisiert (soweit verfügbar, sonst UK)

source: Main window
de: Hauptfenster

source: Always
de: Immer

source: Presentation
de: Aufbereitung

source: Changes to the textured background in the main window will not take effect until you restart Rosegarden.
de: Änderungen am texturierten Hintergrund im Hauptfenster werden sich erst nach einem Neustart von Rosegarden auswirken.

source: Base octave number for MIDI pitch display
de: Basis-Oktavennummer für die MIDI-Tonhöhenanzeige

source: Always use default studio when loading files
de: Beim laden von Dateien immer "default"-Studio benutzen

source: Rosegarden can send all MIDI Controllers (Pan, Reverb etc) to all MIDI devices every time you hit play if you so wish. Please note that this option will usually incur a delay at the start of playback due to the amount of data being transmitted.
de: Rosegarden kann alle MIDI Steuernachrichten (Pan, Hall, etc.) jedesmal an alle MIDI Geräte senden, wenn Sie "Wiedergabe" drücken. Bitte beachten Sie, dass diese Option wegen der zu übertragenden Datenmenge normalerweise eine Verzögerung zum Beginn der Wiedergabe verursacht.

source: Sequencer timing source
de: Zeitgeber (-Quelle) des Sequencers

source: Load SoundFont to SoundBlaster card at startup
de: Beim Starten lade SoundFont in die SoundBlaster Karte

source: Check this box to enable soundfont loading on EMU10K-based cards when Rosegarden is launched
de: Mache einen Hacken um das Laden von SoundFont für EMU10K-basierte Karten beim Start von Rosegarden einzuschalten

source: Path to 'asfxload' or 'sfxload' command
de: Pfad zum 'asfxload' oder 'sfxload' Befehl

source: General
de: Allgemein

source: MIDI Clock and System messages
de: MIDI-Clock und -System-Nachrichten

source: Send MIDI Clock, Start and Stop
de: MIDI-Clock, -Start und -Stop -Nachrichten senden

source: Accept Start, Stop and Continue
de: Reagiere auf Start, Stop und Continue

source: MIDI Machine Control mode
de: MIDI Machine Control Modus

source: MIDI Time Code mode
de: MIDI Time Code Modus

source: Automatically connect sync output to all devices in use
de: Verbinde Sync-Ausgang automatisch mit allen verwendeten Geräten

source: sfxload path
de: sfxload Pfad

source: Soundfont path
de: SoundFont Pfad

source: General Configuration
de: Allgemeine Konfiguration

source: %1 minutes %2.%3%4 seconds (%5 units, %6 measures)
de: %1 Minuten %2.%3%4 Sekunden (%5 Einheiten, %6 Takte)

source: Filename:
de: Dateiname:

source: Formal duration (to end marker):
de: Formale Länge (bis zur Ende-Markierung):

source: Playing duration:
de: Spieldauer:

source: Tracks:
de: Spuren:

source: %1 used, %2 total
de: %1 verwendet, %2 Gesamt

source: Segments:
de: Segmente:

source: %1 MIDI, %2 audio, %3 total
de: %1 MIDI, %2 Audio, %3 Gesamt

source: Statistics
de: Statistiken

source: Track
de: Spur

source: Label
de: Bezeichnung

source: Time
de: Zeit

source: Polyphony
de: Polyphonie

source: Repeat
de: Wiederholen

source: Transpose
de: Transponieren

source: Delay
de: Verzögerung

source: Segment Summary
de: Segment Zusammenfassung

source: Audio file path:
de: Pfad für Audiodateien

source: Choose...
de: Auswählen...

source: Disk space remaining:
de: Verbleibender Plattenplatz:

source: Equivalent minutes of 16-bit stereo:
de: Entsprechende Anzahl Minuten bei 16-bit-Stereo

source: Modify audio path
de: Audiodateipfad ändern

source: %1 out of %2 (%3% used)
de: %1 von %2 (%3% verwendet)

source: minutes at
de: Minuten bei

source: MIDI Settings
de: MIDI Einstellungen

source: Default layout mode
de: Default Layout-Modus

source: Linear layout
de: Lineares Layout

source: Continuous page layout
de: Fortlaufende Seite Layout

source: Multiple page layout
de: Mehrere Seiten Layout

source: Default spacing
de: Standard-Abstände

source: Default duration factor
de: Standard Längen Faktor

source: Full
de: Ganz

source: When needed
de: Wenn benötigt

source: Show non-notation events as question marks
de: Nicht-Notationsevents als Fragezeichen zeigen

source: Show notation-quantized notes in a different color
de: Notations-quantisierte Events in einer anderen Farbe anzeigen

source: Show "invisible" events in grey
de: "unsichtbare" Events in grau anzeigen

source: Show notes outside suggested playable range in red
de: Noten außerhalb des vorgeschlagenen spielbaren Bereiches in Rot zeigen

source: When recording MIDI, split-and-tie long notes at barlines
de: Bei MIDI-Aufnahme: Teile lange Noten an Taktstrichen und verbinde sie.

source: Default note style for new notes
de: Standard Notenstil für neue Noten

source: When inserting notes...
de: Beim Einfügen neuer Noten...

source: Split notes into ties to make durations match
de: Noten in "verbundene" aufbrechen, um Längen in Übereinstimmung zu bringen

source: Ignore existing durations
de: Vorhandene Längen ignorieren

source: Auto-beam on insert when appropriate
de: Balken automatisch hinzufügen, wenn angemessen

source: Collapse rests after erase
de: Pausen nach Löschen zusammenfassen

source: Default paste type
de: Standard-Einfügetyp

source: Editing
de: Ändern

source: Accidentals in one octave...
de: Vorzeichen in einer Oktave...

source: Affect only that octave
de: Betrifft nur diese Oktave

source: Require cautionaries in other octaves
de: Verlange Sicherheitsvorzeichen in anderen Oktaven

source: Affect all subsequent octaves
de: Betrifft alle folgenden Oktaven

source: Accidentals in one bar...
de: Vorzeichen innerhalb eines Taktes...

source: Affect only that bar
de: Betrifft nur diesen Takt

source: Require cautionary resets in following bar
de: Verlange Sicherheitsauflösungszeichen im folgenden Takt

source: Require explicit resets in following bar
de: Verlange ausdrückliche Auflösungszeichen im folgenden Takt

source: Cancel only when entering C major or A minor
de: Nur bei Eingabe von C-dur oder a-moll auflösen

source: Cancel whenever removing sharps or flats
de: Immer auflösen, wenn # oder b entfernt werden

source: Cancel always
de: Immer auflösen

source: Accidentals
de: Vorzeichen

source: Notation font
de: Notationsfont

source: Origin:
de: Ursprung:

source: Mapped by:
de: Zugeordnet von:

source: Type:
de: Typ:

source: Font size for single-staff views
de: Fontgröße für Ansichten mit einem System

source: Font size for multi-staff views
de: Fontgröße für Ansichten mit mehreren Systemen

source: Font size for printing (pt)
de: Fontgröße zum Drucken (in Punkten)

source: Text font
de: Schriftart für Text

source: %1 (smooth)
de: %1 (sanft)

source: %1 (jaggy)
de: %1 (zackig)

source: Audio Settings
de: Audioeinstellungen

source: JACK latency
de: Jack-Verzögerung

source: Use the "Fetch JACK latencies" button to discover the latency values set at the sequencer. It's recommended that you use the returned values but it's also possible to override them manually using the sliders. Note that if you change your JACK server parameters you should always fetch the latency values again. The latency values will be stored by Rosegarden for use next time.
de: Benutzen Sie den Knopf "JACK-Verzögerungen holen" um auf die Verzögerungswerte des Sequncers zuzugreifen. Wir empfehlen Ihnen, die zurückgelieferten Werte zu verwenden, aber es ist auch möglich, diese Werte manuell mit den Stellbalken zu verändern. Denken Sie daran, immer die Verzögerungswerte erneut zu holen, wenn Sie die Jack-Serverparameter verändern. Rosegarden speichert die Verzögerungswerte für die nächste Verwendung.

source: JACK playback latency (in ms)
de: Wiedergabeverzögerung für JACK (in ms)

source: JACK record latency (in ms)
de: Aufnahmeverzögerung für JACK (in ms)

source: Fetch JACK latencies
de: JACK-Verzögerungen holen

source: JACK Latency
de: Jack Verzögerung

source: Audio preview scale
de: Audio-Skalierung bei Vorschau

source: Linear - easier to see loud peaks
de: Linear - macht es einfacher, laute Stellen zu erkennen

source: Meter scaling - easier to see quiet activity
de: Meßgerät Skalierung - erleichtert das erkennen von Aktivität bei ruhigen Stellen

source: Record audio files as
de: Speichere Audio-Aufnahmen als

source: 16-bit PCM WAV format (smaller files)
de: 16-bit PCM WAV Format (kleinere Dateien)

source: 32-bit float WAV format (higher quality)
de: 32-bit float WAV Format (höhere Qualität)

source: External audio editor
de: Erterner Audioeditor

source: Start JACK when Rosegarden starts
de: JACK mit Rosegarden starten

source: JACK command
de: JACK-Startanweisung

source: External audio editor path
de: Erterner Audioeditor

source: External audio editor "%1" not found or not executable
de: Der externe Audioeditor "%1" wurde nicht gefunden, oder ist nicht ausführbar.

source: Add New Color
de: Neue Farbe hinzufügen

source: Delete Color
de: Farbe löschen

source: Color Map
de: Farbtabelle

source: New Color Name
de: Neuer Farbname

source: New
de: Neu

source: Latency
de: Verzögerung

source: Sequencer Latency
de: Sequencer-Verzögerung

source: Color Settings
de: Farbeinstellungen

source: Key Mapping
de: Tasten-Übersetzungstabelle

source: Manage MIDI Banks and Programs
de: MIDI-Bänke und -Programme verwalten

source: MIDI Device
de: MIDI-Gerät

source: Add Bank
de: Bank hinzufügen

source: Add Key Mapping
de: Tasten-Übersetzungstabelle hinzufügen

source: Add a Bank to the current device
de: Zum aktuellen Gerät eine Bank hinhzufügen

source: Add a Percussion Key Mapping to the current device
de: Füge Percussions-Tasten-Übersetzungstabelle zum aktuellen Gerät hinzu

source: Delete the current Bank or Key Mapping
de: Aktuelle Bank oder Tasten-Übersetzungstabelle löschen

source: Delete all Banks and Key Mappings from the current Device
de: Alle Bänke und Tasten-Übersetzungstabellen im aktuellen Gerät löschen

source: Export...
de: Exportieren als...

source: Import Bank and Program data from a Rosegarden file to the current Device
de: Bank- und Programmdaten aus einer Rosegarden-Datei in das aktuelle Gerät importieren

source: Export all Device and Bank information to a Rosegarden format interchange file
de: Alle Geräte- und Bank-Informationen in ein Rosegarden-Datenaustauschformat exportieren

source: Copy all Program names from current Bank to clipboard
de: Alle Programmnamen der aktuellen Bank in die Zwischenablage kopieren

source: Paste Program names from clipboard to current Bank
de: Programmnamen von der Zwischenablage in die aktuelle Bank einfügen

source: Show Variation list based on
de: Abweichungsliste anzeigen basiert auf

source: <new bank>
de: <Neue Bank>

source: <new mapping>
de: <Neue Bank>

source: <new mapping %1>
de: <Neue Bank>

source: Really delete this bank?
de: Diese Bank wirklich löschen?

source: Really delete this key mapping?
de: Diese Bank wirklich löschen?

source: Really delete all banks for
de: Wirklich alle Bänke löschen für

source: Import Banks from Device in File
de: Bänke von einem Gerät in eine Datei importieren

source: Export Device as...
de: Gerät exportieren als...

source: There are unsaved changes. Do you want to apply the changes before exiting the Bank Editor or discard the changes ?
de: Ungesicherte Änderungen: Vor Verlassen des Bank-Editors Änderungen speichern oder verwerfen

source: Unsaved Changes
de: Tonart-Veränderung

source: Librarian
de: Bibliothekar

source: The librarian maintains the Rosegarden device data for this device. If you've made modifications to suit your own device, it might be worth liaising with the librarian in order to publish your information for the benefit of others.
de: Der Bibliothekar verwaltet die Daten, die Rosegarden zu diesem Gerät kennt. Falls Sie hier Anpassungen vorgenommen haben, um Ihr eigenes Gerät besser zu unterstützen, sollten Sie überlegen den Bibliothekar zu kontaktieren, damit möglicherweise auch Andere von Ihren Anpassungen profitieren können.

source: Change Record Device
de: Aufnahmegerät wechseln

source: Manage MIDI Devices
de: MIDI-Geräte verwalten...

source: Play devices
de: Vorschau abspielen

source: Connection
de: Verbindung

source: Banks...
de: Bänke verwalten...

source: Control Events...
de: Kontroll-Events...

source: Create a new Play device
de: Neues Abspielgerät anlegen

source: Delete the selected device
de: Gewähltes Gerät löschen

source: Import Bank, Program and Controller data from a Rosegarden file to the selected device
de: Bank- und Programmdaten aus einer Rosegarden-Datei in das aktuelle Gerät importieren

source: Export Bank and Controller data to a Rosegarden interchange file
de: Alle Geräte- und Bank-Informationen in ein Rosegarden-Datenaustauschformat exportieren

source: View and edit Banks and Programs for the selected device
de: Ansehen und ändern von Bänken und Programmen für das ausgewählte Gerät
