Repository: nengxu/rosegarden
Catalog: po/*.po
Languages: de

source: View and edit Control Events for the selected device - these are special Event types that you can define against your device and control through Control Rulers or the Instrument Parameter Box
de: Ansehen und ändern der Kontrol-Events für das ausgewählte Gerät - es handelt sich hierbei um spezielle Event-Typen, die Sie für Ihr Gerät definieren und mittels der Kontrollineale der Instrument Parameter Box kontrollieren können.

source: Record devices
de: Aufnahmegeräte

source: Current
de: Aktuell

source: Create a new Record device
de: Erzeuge ein neues Aufnahmegerät

source: New Device
de: Neues Gerät

source: Import from Device in File
de: Von Gerät in Datei importieren

source: Remap Instrument assigments...
de: Instrumentzuordnungen neu verteilen...

source: Device or Instrument
de: Gerät oder Instrument

source: Remap Tracks by all Instruments on a Device or by single Instrument
de: Spuren für alle Instrumente eines Geräts oder für ein einzelnes Instrument neu verteilen

source: Choose Source and Destination
de: Quelle und Ziel wählen

source: From
de: Von

source: To
de: Nach

source: <no devices>
de: <keine Geräte>

source: Show Audio &Faders
de: Zeige Audio &Fader

source: Show Synth &Faders
de: Zeige Synth &Fader

source: Show &Submasters
de: Zeige Gruppenfader

source: Show &Plugin Buttons
de: Audio-Plugin-Knopf

source: Show &Unassigned Faders
de: Zeige nicht zugeordnete Fader

source: _n: 1 Input %n Inputs
de: _n: 1 Eingang %n Eingänge

source: No Submasters
de: Keine Gruppenfader

source: _n: 1 Submaster %n Submasters
de: _n: 1 Gruppenfader %n Gruppenfader

source: Audio Mixer
de: Audio Fader

source: Record input source
de: Aufnahmequelle

source: Output destination
de: Ausgabeziel

source: Mono or stereo
de: Mono oder Stereo

source: Mute
de: Stummschalten

source: Arm recording
de: Aufnahme vorbereiten

source: Audio master output level
de: Audio Master Ausgangspegel

source: Manage Synth Plugins
de: Synth Plugins verwalten

source: Bank and Program details
de: Bank- und Programm-Details

source: Programs
de: Programme

source: MSB Value
de: MSB-Wert

source: Selects a MSB controller Bank number (MSB/LSB pairs are always unique for any Device)
de: Wählt eine Banknummer des MSB-Controllers aus (MSB/LSB-Paare sind stets eindeutig für ein Gerät)

source: Selects a LSB controller Bank number (MSB/LSB pairs are always unique for any Device)
de: Wählt eine Banknummer des LSB-Controllers aus (MSB/LSB-Paare sind stets eindeutig für ein Gerät)

source: LSB Value
de: LSB-Wert

source: Key Mapping: %1
de: Tasten-Übersetzungstabelle: %1

source: <no key mapping>
de: <keine Tasten-Übersetzungstabelle>

source: Key Mapping details
de: Tasten-Übersetzungstabelle Details

source: Pitches
de: Tonhöhen

source: MIDI Mixer
de: MIDI Mischer

source: Volume
de: Lautstärke

source: Plugin slot %1
de: Plugin %1

source: Add Play Device
de: Wiedergabegerät hinzufügen

source: Add Record Device
de: Aufnahmegerät hinzufügen

source: Delete Device
de: Gerät löschen

source: Play
de: Wiedergabe

source: Record
de: Aufnahme

source: Apply pending changes?
de: Ausstehende Änderungen anwenden?

source: <new device>
de: <Neues Gerät>

source: Click on a segment to delete it
de: Ein Klick auf das Segment löscht dieses.

source: Click on a segment to split it in two; hold Shift to avoid snapping to beat grid
de: Klick auf Segment teilt es in zwei; Halten Sie Shift gedrückt, um das Einrasten an Taktschlägen zu vermeiden.

source: Click on a segment to split it in two
de: Klicken auf ein Segment, teilt es in zwei

source: Click and drag to select segments
de: Klicken und ziehen um Segmente auszuwählen

source: Move Segment
de: Segment bewegen

source: Move Segments
de: Segmente bewegen

source: Hold Shift to avoid snapping to beat grid
de: Drücken der Shift-Taste vermeidet das Einrasten am Taktschlag oder Gitter.

source: Click and drag to select segments; middle-click and drag to draw an empty segment
de: Für eine Auswahl klicken und ziehen; Mittel-Klick und ziehen erstellt ein neues leeres Segment

source: Click and drag to resize a segment; hold Ctrl as well to rescale its contents
de: Klicken und ziehen verändert die Länge des Segments; Bei halten der Ctrl-Taste werden auch die Segment-Inhalte skaliert/verändert

source: Click and drag to rescale segment
de: Klicken und ziehen verändert die Länge des Segments

source: Click and drag to move segments; hold Ctrl as well to copy them
de: Klicken und ziehen bewegt das Segment. Bei halten der Shift-Taste wird eine Kopie erstellt.

source: Click and drag to copy segments
de: Klicken und ziehen kopiert ein Segment

source: Click and drag to move segment; hold Ctrl as well to copy it; double-click to edit
de: Klicken und ziehen bewegt ein Segment; Bei halten der Ctrl-Taste wird eine Kopie erstellt; Doppelklick zum editieren

source: Click and drag to copy segment
de: Klicken und ziehen kopiert ein Segment.

source: Hold Shift to avoid snapping to beat grid; hold Ctrl as well to rescale contents
de: Halten der Shift-Taste verhindert ein Einrasten zum Taktschlag/Gitter; Halten der Ctrl-Taste bewirkt eine Skalierung der Segment-Inhalte

source: Click and drag to move a segment
de: Klicken und ziehen bewegt ein Segment

source: Hold Shift to avoid snapping to bar lines
de: Halten der Shift-Taste verhindert ein Einrasten an Taktlinien

source: Click and drag to draw an empty segment. Control+Alt click and drag to draw in overlap mode.
de: Klicken und ziehen erstellt ein leeres Segment. Halten von Control+Alt um überlappende Segemente zu erstellen.

source: Click and hold with left mouse button to assign this Track to an Instrument.
de: Klicke und halte mit dem linken Mausknopf um diese Spur einem Instrument zuzuweisen.

source: Change track name
de: Spurnamen ändern

source: Enter new track name
de: Neuen Spurnamen eingeben

source: Turn Repeating Segment into Real Copies
de: Wiederholungssegment in echte Kopien umwandeln

source: Turn Repeating Segments into Real Copies
de: Wiederholungssegmente in echte Kopien umwandeln

source: You can't drop files into Rosegarden from this client. Try using Konqueror instead.
de: Von diesem Programm aus können Sie keine Dateien in Rosegarden "hinüberziehen". Probieren Sie es doch mit Konqueror.

source: Manage Triggered Segments
de: Verwalte getriggerte Segmente

source: Base velocity
de: Basis Anschlagstärke

source: Triggers
de: Trigger

source: Add a Triggered Segment
de: Füge getriggertes Segment hinzu

source: Delete a Triggered Segment
de: Lösche getriggertes Segment

source: Delete All Triggered Segments
de: Alle getriggerten Segemente löschen

source: Close the Triggered Segment Manager
de: Schleße den Getriggerte Segmente Manager

source: <no label>
de: (keine)

source: _n: %1 on 1 track %1 on %n tracks
de: _n: %1 auf 1 Spur %1 auf %n Spuren

source: This will remove all triggered segments from the whole composition. Are you sure?
de: Das wird alle getriggerten Segmente der gesamten Komposition entfernen. Sind Sie sicher?

source: Remove all triggered segments
de: Entferne alle getriggerten Segmente

source: Trigger Segment Duration
de: Länge des getriggerten Segments

source: _n: This triggered segment is used 1 time in the current composition. Are you sure you want to remove it? This triggered segment is used %n times in the current composition. Are you sure you want to remove it?
de: _n: Dieses getriggerte Segment wird 1 mal in der aktuellen Komposition verwendet.Sind Sie sicher, daß Sie es entfernen möchten? Dieses getriggerte Segment wird %n mal in der aktuellen Komposition verwendet.Sind Sie sicher, daß Sie es entfernen möchten?

source: Pa&ste as New Triggered Segment
de: Als neues getriggertes Segment einfügen

source: Manage Markers
de: Marker verwalten

source: Marker time
de: Marker Zeit

source: Marker description
de: Marker Beschreibung

source: Pointer position
de: Zeiger Position

source: Real time:
de: Reale Zeit

source: In measure:
de: In Takten:

source: Add a Marker
de: Marker hinzufügen

source: Delete a Marker
de: Marker löschen

source: Delete All Markers
de: Alle Marker löschen

source: Close the Marker Editor
de: Marker Editor schließen

source: Remove all markers
de: Alle Marker entfernen

source: Add...
de: Hinzufügen...

source: Move Up
de: Nach oben

source: Move Down
de: Nach unten

source: Select one or more Rosegarden files
de: Eine oder mehrere Rosegarden-Dateien auswählen

source: <not showing>
de: <nicht dargestellt>

source: Edit Control Parameter
de: Control Parameter anpassen

source: Control Event Properties
de: Event-Eigenschaften

source: Control Event value:
de: Controller

source: Minimum value:
de: Minimaler Wert:

source: Maximum value:
de: Maximaler Wert:

source: Default value:
de: Standardwert:

source: Color:
de: Farbe:

source: Instrument Parameter Box position:
de: Position der Instrument-Parameter-Box:

source: Manage Control Events
de: Control Events verwalten

source: <no device>
de: <keine Geräte>

source: Control Events for %1 (device %2)
de: Control Events für %1 (Gerät %2)

source: Control Event type
de: Control Event-Art

source: Control Event value
de: Control Event Wert

source: Description
de: Beschreibung

source: Default
de: Standard-Einfügetyp

source: Color
de: Farbe

source: Position on instrument panel
de: Position in der Instrumentenansicht

source: Add a Control Parameter to the Studio
de: Control Parameter zum Studio hinzufügen

source: Delete a Control Parameter from the Studio
de: Control Parameter aus dem Studio löschen

source: Close the Control Parameter editor
de: Control Parameter Editor schließen

source: <default>
de: <Standard>

source: <no instrument>
de: <kein Instrument>

source: <untitled audio>
de: <unbenanntes Audio>

source: <untitled>
de: <ohne Titel>

source: Mute track
de: Spur stummschalten

source: Record on this track
de: Auf dieser Spur aufnehmen

source: Segment Parameters
de: Segment Parameter

source: Highest playable note
de: Höchste spielbare Note

source: Lowest playable note
de: Tiefste spielbare Note

source: Track Parameters
de: Spurparameter

source: Playback parameters
de: Wiedergabeparameter

source: Recording filters
de: Aufnahmefilter

source: Channel
de: Kanal

source: Notation size:
de: Notationsgröße:

source: Small
de: Klein

source: Tiny
de: Winzig

source: Bracket type:
de: Art der Klammern:

source: Create segments with
de: Segmente erzeugen mit

source: Preset
de: Voreinstellung

source: Load
de: Laden

source: treble
de: Sopran

source: bass
de: Baß

source: guitar
de: Guitarre

source: contrabass
de: Kontrabaß

source: old celesta
de: Alte Celesta

source: soprano
de: Sopran

source: mezzosoprano
de: Mezzo-Sopran

source: alto
de: Alt

source: Lowest
de: Niedrigste

source: Choose the lowest suggested playable note, using a staff
de: Wählen Sie die tiefste vorgeschlagene spielbare Note, unter Verwendung des Notensystems

source: Highest
de: Höchste

source: Choose the highest suggested playable note, using a staff
de: Wählen Sie die höchste vorgeschlagene spielbare Note, unter Verwendung des Notensystems

source: The instrument preset database is corrupt. Check your installation.
de: Die Instrumentvoreinstellungen Datenbank ist korrupt. Überprüfen Sie Ihre Installation.

source: Instrument Parameters
de: Instrumentenparameter

source: Program
de: Programm

source: Channel out
de: Ausgabekanal

source: Switch to Draw Tool
de: Zum Zeichenwerkzeug wechseln

source: Switch to Erase Tool
de: Zum Löschwerkzeug wechseln

source: Switch to Move Tool
de: Zum Bewegungswerkzeug wechseln

source: Switch to Resize Tool
de: Zum Größenänderungswerkzeug wechseln

source: Click and drag to select; middle-click and drag to draw new note
de: Klicken und ziehen bewirkt eine Auswahl. Mittel-Klick und ziehen erstellt neue Note.

source: Click and drag to resize selected notes
de: Klicken und ziehen verändert Notenlänge

source: Click and drag to resize note
de: Klicken und ziehen zum ändert der Notenlänge

source: Click and drag to move selected notes; hold Ctrl as well to copy
de: Klicken und ziehen bewegt ausgeählte Noten. Halten der Ctrl-Taste erstellt eine Kopie.

source: Click and drag to copy selected notes
de: Klicken und ziehen kopiert ausgewählte Noten

source: Click and drag to move note; hold Ctrl as well to copy
de: Klicken und ziehen um Note zu bewegen. Halten von Ctrl erstellt Kopie.

source: Click and drag to copy note
de: Klicken und ziehen kopiert Note

source: Switch to Select Tool
de: Zum Auswahlwerkzeug wechseln

source: Resize Event
de: Eventgröße verändern

source: Resize Events
de: Eventgrößen verändern

source: Click and drag to resize a note
de: Klicken und ziehen verändert Notenlänge

source: Copy and Move Event
de: Event kopieren und bewegen

source: Copy and Move Events
de: Mehrere Events kopieren und bewegen

source: Move Event
de: Event bewegen

source: Move Events
de: Events bewegen

source: Click and drag to move a note; hold Ctrl as well to copy it
de: Klicken und ziehen bewegt eine Noten. Halten der Ctrl-Taste erstellt eine Kopie

source: Click and drag to copy a note
de: Klicken und ziehen kopiert eine Note

source: Click and drag to draw a note; Shift to avoid snapping to grid
de: Klicken und ziehen malt eine neue Note. Halten der Shift-Taste verhindert einrasten am Gitter.

source: Click and drag to draw a note
de: Klicken und ziehen malt eine neue Note

source: Couldn't apply piano roll layout
de: Klavierrollen-Layout konnte nicht angewandt werden

source: Resi&ze
de: Größe &ändern

source: C&hord Insert Mode
de: A&kkord-Einfügemodus

source: Ste&p Recording
de: Schritt&weise Aufnahme

source: Set to Current Velocity
de: Setze auf momentane Anschlagstärke

source: Set Event &Velocities...
de: Anschlagstärke der Events setzen...

source: Remove Triggers...
de: &Tempoveränderungen entfernen...

source: Select &All
de: &Alles auswählen

source: Cursor &Back
de: Cursor &zurück

source: Cursor &Forward
de: Cursor &vorwärts

source: Cursor Ba&ck Bar
de: Cursor &Takt zurück

source: Cursor For&ward Bar
de: Cursor Ta&kt vorwärts

source: Cursor Back and Se&lect
de: Cursor zurück und Aus&wählen

source: Cursor Forward and &Select
de: Cursor vorwärts und auswäh&len

source: Cursor Back Bar and Select
de: Cursor Takt zurück und auswählen

source: Cursor Forward Bar and Select
de: Cursor Takt vorwärts und auswählen

source: Cursor to St&art
de: Cursor zum &Anfang

source: Cursor to &End
de: Cursor zum &Ende

source: Cursor to &Playback Pointer
de: Cursor zum &Wiedergabezeiger

source: Playback Pointer to &Cursor
de: Wiedergabezeiger zum &Cursor

source: Set Loop to Selection
de: Auswahl als Schleife festlegen

source: Clear L&oop
de: Schleife l&öschen

source: Clear Selection
de: Auswahl löschen

source: &Filter Selection
de: &Filter-Auswahl

source: &No Snap
de: &Einrasten aus

source: Snap to Bea&t
de: Auf Schla&g einrasten

source: Snap to &Bar
de: Auf &Takt einrasten

source: Show Instrument Parameters
de: &Instrumentparameter anzeigen

source: Show Ch&ord Name Ruler
de: Ak&kordnamenlineal anzeigen

source: Show &Tempo Ruler
de: &Tempolineal anzeigen

source: _n: 1 event selected %n events selected
de: _n: 1 Event ausgewählt %n Events ausgewählt

source: No selection
de: Keine Auswahl

source: Quantizing...
de: Quantisieren...

source: Collapsing notes...
de: linkend=\"nv-rulers\">Rulers and Cursors</link>

source: Making legato...
de: Mache Legato...

source: Time: %1 (%2.%3s)
de: Zeit: %1 (%2.%3)

source: Cutting selection to clipboard...
de: Auswahl in die Zwischenablage ausschneiden...

source: Couldn't paste at this point
de: An dieser Stelle kein Einfügen möglich

source: Deleting selection...
de: Auswahl löschen...

source: Unknown note insert action %1
de: Unbekannte Noten-Einfügeaktion %1

source: Inserting note
de: Note einfügen

source: Unquantizing...
de: Dequantisieren...

source: Grid:
de: Raster:

source: Unit
de: Einheit

source: Bar
de: Takt

source: Velocity:
de: Anschlagstärke:

source: Quantize:
de: Quantisieren:

source: Raising velocities...
de: Anschlagstärke erhöhen...

source: Lowering velocities...
de: Anschlagstärke verringern...

source: Set Event Velocities
de: Anschlagstärke der Events setzen

source: Setting Velocities...
de: Anschlagstärke setzen...

source: Remove Triggers
de: Alle Ma&rken löschen

source: %1 - Segment Track #%2 - %3
de: %1 - Segment Spur #%2 - %3

source: %1 - All Segments - %2
de: %1 - Alle Segmente - %2

source: _n: %1 - 1 Segment - %2 %1 - %n Segments - %2
de: _n: %1 - 1 Segment - %2 %1 - %n Segmente - %2

source: Can't insert note: No grid duration selected
de: Kann Note nicht einfügen: Keine Rasterdauer gewählt

source: Click on a note to delete it
de: Auf eine Note klicken, um diese zu löschen

source: Time
de: Zeit

source: Type
de: Typ

source: Value
de: Wert

source: Properties
de: Eigenschaften

source: Common, hidden
de: Allgemein, versteckt

source: Hidden
de: Versteckt

source: Common
de: Allgemein

source: Time Signature
de: Taktart

source: <nothing at this filter level>
de: <nichts auf dieser Filterebene>

source: Delete Tempo or Time Signature
de: Tempo oder Taktart löschen

source: &Edit Item
de: Objekt b&earbeiten

source: %1 - Tempo and Time Signature Editor
de: %1 - Tempo- und Taktart-Editor

source: Extension
de: Erweiterung

source: couldn't parse fingering '%1' in '%2'
de: Konnte den Fingersatz '%1' in '%2' nicht erkennen ('parsen').

source: Guitar Chord Selector
de: Gitarren-Akkord wählen

source: beginner
de: Anfänger

source: common
de: allgemein

source: Fingerings
de: &Fingersätze

source: couldn't open file '%1'
de: Datei %1 kann nicht geöfnet werden '

source: couldn't parse chord dictionary : %1
de: Konnte Akkord-Wörterbuch nicht parsen.

source: Note Font Viewer: %1
de: Noten Schriftart Anzeige: %1

source: Component:
de: Komponente

source: View:
de: Ansicht

source: Glyphs
de: Akzentuierungszeichen

source: Page:
de: Seite:

source: Switch to Inserting Notes
de: Zum Einfügen von Noten wechseln

source: Preparing to print...
de: Druck wird vorbereitet...

source: Note &Font
de: Noten&font

source: Si&ze
de: &Größe

source: S&pacing
de: &Abstände

source: Du&ration Factor
de: Dauer:

source: Note &Style
de: Noten&stil

source: Insert Rest
de: Pause einfügen

source: Switch from Note to Rest
de: Von Note auf Pause umschalten

source: Switch from Rest to Note
de: Von Pause auf Note umschalten

source: No accidental
de: Kein Vorzeichen

source: Follow previous accidental
de: Vorzeichen werden erzwungen...

source: Sharp
de: Kreuz

source: Flat
de: B

source: Natural
de: l

source: Double sharp
de: Doppelkreuz

source: Double flat
de: Doppel-B

source: &Treble Clef
de: &Violinschlüssel

source: &Alto Clef
de: &Altschlüssel

source: Te&nor Clef
de: &Tenorschlüssel

source: &Bass Clef
de: &Bassschlüssel

source: Select from Sta&rt
de: Vom Sta&rt an auswählen

source: Select to &End
de: Bis zum &Ende auswählen

source: Select Whole St&aff
de: Das komplette S&ystem auswählen

source: C&ut and Close
de: Sch&neiden und Schließen

source: Pa&ste...
de: Ein&fügen...

source: &Linear Layout
de: &Lineares Layout

source: &Continuous Page Layout
de: &Seitenlayout

source: &Multiple Page Layout
de: &Seitenlayout

source: Show Ra&w Note Ruler
de: &Rohnotenlineal zeigen

source: Show &Annotations
de: &Bemerkungen zeigen

source: Show Lily&Pond Directives
de: Zeige Lily&Pond Anweisungen

source: Open L&yric Editor
de: &Texteditor öffnen

source: Trip&let Insert Mode
de: Tri&olen-Einfügemodus

source: &Dump selected events to stderr
de: &Ausgewählte Events nach stderr ausgeben

source: Ma&ke Ornament...
de: Verzierungen...

source: Trigger &Ornament...
de: Trigger Verzierung...

source: Remove Ornament...
de: Verzierung entfernen...

source: &None
de: &Kein

source: Show &Notes Toolbar
de: &Noten-Werkzeugleiste anzeigen

source: Show &Rests Toolbar
de: &Pausen-Werkzeugleiste anzeigen

source: Show &Accidentals Toolbar
de: &Vorzeichen-Werkzeugleiste anzeigen

source: Show Cle&fs Toolbar
de: &Schlüssel-Werkzeugleiste anzeigen

source: Show &Marks Toolbar
de: &Vortragszeichen-Werkzeugleiste anzeigen

source: Show &Group Toolbar
de: &Gruppen-Werkzeugleiste anzeigen

source: Show &Layout Toolbar
de: &Layout-Werkzeugleiste anzeigen

source: Show M&eta Toolbar
de: M&eta-Werkzeugleiste anzeigen

source: Cursor &Up Staff
de: Cursor ein System nach &oben

source: Cursor &Down Staff
de: Cursor ein System nach &unten

source: Cursor Pre&vious Segment
de: Cursor zum &vorherigen Segment

source: Push &Left
de: Nach &links schieben

source: Push &Right
de: Nach &rechts schieben

source: Push &Up
de: Nach oben schieben

source: Push &Down
de: Nach unten schieben

source: &Restore Positions
de: Be&rechnete Positionen wiederherstellen

source: Make &Invisible
de: Mache unsichtbar

source: Make &Visible
de: Mach sichtbar

source: Toggle Dot
de: Punktierung umschalten

source: Add Dot
de: Punktierung hinzufügen

source: _n: 1 pixel %n pixels
de: _n: 1 Pixel %n Pixel

source: Unknown font "%1", using default
de: Font "%1" ist unbekannt, stattdessen wird der Standardfont benutzt

source: Size:
de: Größe

source: Spacing:
de: Abstände

source: Ready.
de: Fertig.

source: Laying out score...
de: Partitur wird angeordnet...

source: Laying out staff %1...
de: System %1 wird angeordnet...

source: Reconciling staffs...
de: Systeme werden ausgerichtet...

source: Sizing and allocating canvas...
de: Die Darstellungsfläche wird berechnet...

source: rest
de: Pause

source: %1 - Segment Track #%2 - Notation
de: %1 - Segment Spur #%2 - Notation

source: %1 - All Segments - Notation
de: %1 - Alle Segmente - Notation

source: _n: %1 - Segment - Notation %1 - %n Segments - Notation
de: %1 - Segment - Notation %1 - %n Segmente - Notation

source: Hidden annotations
de: Verborgene Anmerkungen

source: Hidden LilyPond directives
de: Verborgene LilyPond Anweisungen

source: Unknown spacing action %1
de: Abstandsaktion %1 ist unbekannt

source: Unknown proportion action %1
de: Proportions-Aktion %1 ist unbekannt

source: Unknown font action %1
de: Font-Aktion %1 ist unbekannt

source: Unknown font size %1
de: Unbekannte Fontgröße: %1

source: Unknown font size action %1
de: Unbekannte Fontgrößenaktion: %1

source: Can't paste multiple Segments into one
de: Mehrere Segments können nicht in eins eingefügt werden

source: Couldn't paste at this point.
de: Kein Einfügen an diesem Punkt möglich

source: Pushing selection left...
de: Auswahl nach links verschieben...

source: Pushing selection right...
de: Auswahl nach rechts verschieben...

source: Pushing selection up...
de: Auswahl nach oben verschieben...

source: Pushing selection down...
de: Auswahl nach unten verschieben...

source: Restoring computed positions...
de: Berechnete Positionen wiederherstellen...

source: Making visible...
de: Sichtbar machen...

source: Making invisible...
de: Unsichtbar machen...

source: Beaming group...
de: Gruppe bekommt Balken...

source: Auto-beaming selection...
de: Auswahl wird automatisch mit Balken versehen...

source: Breaking groups...
de: Gruppen werden aufgebrochen...

source: Untupleting...
de: Tuolen werden aufgelöst...

source: Adding slur...
de: Bogen hinzufügen...

source: slur
de: Bogen

source: Adding phrasing slur...
de: Phrasierungsbogen hinzufügen...

source: phrasing slur
de: Phrasierungsbogen

source: Adding glissando...
de: Glissando hinzufügen...

source: Adding crescendo...
de: Crescendo hinzufügen...

source: dynamic
de: Dynamik

source: Adding decrescendo...
de: Decrescendo hinzufügen...

source: Adding octave...
de: Oktave hinzufügen...

source: ottava
de: 8va

source: Can't add overlapping %1 indications
de: Kann überlappende %1 Bezeichnungen nicht hinzufügen

source: Making chord...
de: Erzeuge Akkord...

source: Normalizing rests...
de: Pausen normalisieren...

source: Collapsing rests...
de: Pausen zusammenfassen...
