Repository: nengxu/rosegarden
Catalog: po/*.po
Languages: de

source: Tying notes...
de: Noten verbinden...

source: Untying notes...
de: Noten trennen...

source: Making notes viable...
de: Noten werden in vernünftige Längen aufgebrochen...

source: Removing counterpoint...
de: Kontrapunkt wird gelöscht...

source: Pointing stems up...
de: Notenhälse nach oben...

source: Pointing stems down...
de: Notenhälse nach unten...

source: Restoring computed stem directions...
de: Errechnete Notenhälse werden wiederhergestellt...

source: Positioning slurs...
de: Bögen positionieren...

source: Restoring slur positions...
de: Bogenpositionen wiederherstellen...

source: Fixing notation quantization...
de: Notations-Quantisierung wird korrigiert...

source: Removing notation quantization...
de: Darstellungsquantisierung entfernen...

source: Changing to %1 style...
de: Wechsel zu Stil %1...

source: Unknown style action %1
de: Unbekannte Stilaktion: %1

source: No note duration selected
de: Keine Dauer ausgewählt

source: No rest duration selected
de: Keine Pausendauer ausgewählt

source: No note or rest duration selected
de: Keine Noten- oder Pausenlänge gewählt

source: Forcing accidentals...
de: Vorzeichen werden erzwungen...

source: Restoring accidentals...
de: Vorzeichen werden wiederhergestellt

source: Showing cautionary accidentals...
de: Zeige Sicherheitsvorzeichen...

source: Cancelling cautionary accidentals...
de: Lösche Sicherheitsvorzeichen...

source: Interpreting selection...
de: Auswahl wird interpretiert...

source: Setting note durations...
de: Notenlänge setzen...

source: Adding dot...
de: Punktierung hinzufügen...

source: Fingering:
de: Fingersatz:

source: Ornament track %1 bar %2
de: Verzierung auf Spur %1 Takt %2

source: Ornament bar %1
de: Verzierung in Takt %1

source: Remove Ornaments
de: Verzierungen entfernen

source: Estimated key signature shown
de: Ermittelte Tonart wird angezeigt

source: Sustain
de: Halten

source: There is no sustain controller defined for this device. Please ensure the device is configured correctly in the Manage MIDI Devices dialog in the main window.
de: Für dieses Gerät ist kein Sustain-Controller definiert. Bitte überprüfen Sie die Einstellungen im Verwalte MIDI Geräte Dialog im Hauptfenster.

source: Can't insert note: No note duration selected
de: Note kann nicht eingefügt werden: Keine Dauer ausgewählt

source: Switch to Insert Tool
de: Zum Einfügewerkzeug wechseln

source: Can't obtain a default font -- no fonts found
de: Kann keine Standardschriftart bestimmen - kein Schriftarten gefunden

source: unknown error
de: unbekannter Fehler

source: Can't open font mapping file %1 or %2
de: Kann Schriftartenübersetzungsdatei %1 oder %2 nicht öffnen

source: Can't open font mapping file %1
de: Die Schriftartenübersetzungsdatei %1 kann nicht geöffnet werden

source: %1-dotted-%2
de: %1-punktiert-%2

source: %1-dotted %2
de: %1-punktiert %2

source: dotted-%1
de: punktiert-%1

source: dotted %1
de: Punktierte %1

source: sixty-fourth note
de: 64tel-Note

source: thirty-second note
de: 32tel-Note

source: sixteenth note
de: 16tel-Note

source: eighth note
de: Achtelnote

source: quarter note
de: Viertelnote

source: half note
de: Halbe Note

source: whole note
de: Ganze Note

source: double whole note
de: Doppelte Ganze Note

source: sixty-fourth notes
de: 64tel-Noten

source: thirty-second notes
de: 32tel-Noten

source: sixteenth notes
de: 16tel-Noten

source: eighth notes
de: Achtelnoten

source: quarter notes
de: Viertelnoten

source: half notes
de: Halbe Noten

source: whole notes
de: Ganze Noten

source: double whole notes
de: Doppelte Ganze Noten

source: %1 triplets
de: %1 Triolen

source: %1 triplet
de: %1 Triole

source: 64th
de: 64tel

source: 32nd
de: 32tel

source: 16th
de: 16tel

source: 8th
de: Achtel

source: quarter
de: Viertel

source: half
de: Halbe

source: whole
de: Ganze

source: double whole
de: Doppelganze

source: 64ths
de: 64tel

source: 32nds
de: 32tel

source: 16ths
de: 16tel

source: 8ths
de: Achtel

source: quarters
de: Viertel

source: halves
de: Halbe Noten

source: wholes
de: Ganze

source: double wholes
de: Doppelganze

source: Error: Unable to match font name %1
de: Fehler: Kann Schriftnamen %1 nicht zuordnen

source: Warning: No good match for font name %1 (best is %2)
de: Warnung: Keine treffende Zuordnung für den Schriftnamen %1 (treffendste ist %2)

source: Error: Unable to open best-match font %1
de: Fehler: Kann die passendste Schriftart %1 nicht öffnen

source: tiny
de: winzig

source: Rendering staff %1...
de: System %1 wird dargestellt...

source: Rendering notes on staff %1...
de: System %1 wird dargestellt...

source: Positioning staff %1...
de: System %1 wird positioniert...

source: Ready.
de: Fertig.

source: Dotted rest
de: Punktierte Pause

source: Can't open style file %1
de: Stildatei %1 kann nicht geöffent werden

source: type is a required attribute of note
de: Das Typattribut wird für die Note benötigt

source: Unrecognised note name %1
de: Unbekannter Notenname: %1

source: global element must precede note elements
de: Globale Elemente müssen vor Notenelementen kommen

source: global and note elements may have shape or charname attribute, but not both
de: global- und note-Elemente dürfen entweder das Attribut shape oder das Attribut charname haben

source: Spanned note at %1 has no HEIGHT_ON_STAFF property! This is a bug (the program would previously have crashed by now)
de: Die Note bei %1 hat keine HEIGHT_ON_STAFF-Eigenschaft! Dies ist ein Fehler (das Programm ist vermutlich inzwischen abgestürzt)

source: Auto-Beam when appropriate
de: Automatisch mit Balken wo angemessen

source: Dotted note
de: Punktierte Note

source: Switch to Inserting Rests
de: Zum EInfügen von Pausen wechseln

source: Collapse Rests
de: Pausen &zusammenfassen

source: Respell as Flat
de: Enharmonisch nach b wechseln

source: Respell as Sharp
de: Enharmonisch nach # wechseln

source: Respell as Natural
de: Enharmonisch ohne Vorzeichen

source: Make Invisible
de: Mache unsichtbar

source: Make Visible
de: Mache sichtbar

source: Event filters
de: Eventfilter

source: Rest
de: Pause

source: Other
de: Andere

source: Triggered Segment Properties
de: Getriggerte Event-Eigenschaften

source: Label:
de: Bezeichnung:

source: Base pitch:
de: Basis Tonhöhe:

source: Base velocity:
de: Basis Anschlagstärke:

source: Duration
de: Dauer

source: Event Type
de: Event-Art

source: Pitch
de: Tonhöhe

source: Velocity
de: Anschlagstärke

source: Type (Data1)
de: Typ (Data1)

source: Value (Data2)
de: Wert (Data2)

source: (group %1)
de: (Gruppe %1)

source: <no events at this filter level>
de: <keine Events auf diesem Filterlevel>

source: <no events>
de: <keine Events>

source: Segment label
de: Segmentbezeichnung ändern

source: Label:
de: Bezeichnung

source: &Insert Event
de: Event e&infügen

source: &Delete Event
de: Event löschen

source: &Edit Event
de: Event verändern

source: &Advanced Event Editor
de: Erweiterter Event-Editor

source: Open in Event Editor
de: Im Event-Editor öffnen

source: Open in Expert Event Editor
de: Im Experten-Event-Editor öffnen

source: %1 - Triggered Segment: %2
de: %1 - Getriggertes Segment: %2

source: %1 - Segment Track #%2 - Event List
de: %1 - Segment Spur #%2 - Event Liste

source: %1 - %2 Segments - Event List
de: %1 - %2 Segmente - Event Liste

source: Insert Tempo Change at Playback Position
de: Te&mpoveränderung an Wiedergabeposition einfügen

source: Delete Tempo Change
de: Te&mpoveränderung löschen

source: Ramp Tempo to Next Tempo
de: Gleichmäßiger Übergang zu nächstem Tempo

source: Un-Ramp Tempo
de: Tempoübergang entfernen

source: Edit Tempo...
de: Tempo.ändern...

source: Edit Time Signature...
de: Taktart ändern...

source: Insert Controller Event
de: Controller Event einfügen

source: Insert Marker
de: Markierung einfügen

source: Delete Marker
de: Markierung löschen

source: Edit Marker...
de: Mar&kierung bearbeiten...

source: Click on a marker to move the playback pointer. Shift-click to set a range between markers. Double-click to open the marker editor.
de: Klick auf einen Marker bewegt den Positionszeiger. Shift-Klick wählt den Bereich zwischen den Markern aus. Doppel-Klick öffnet den Marker Editor.

source: Chord name ruler. Turn it on and off from the Settings->Rulers menu.
de: Akkordlineal. Wird im Menu unter Einstellungen -> Lineale ein- und ausgeschaltet.

source: Erase Controller Event(s)
de: Controller Event(s) entfernen

source: Unsupported Event Type
de: Nicht unterstützter Eventtyp

source: Controller Event Number
de: Controller Event Nummer

source: Add line of controllers
de: Controller Linie hinzufügen

source: Set Segment Start Time...
de: Segment Anfangszeit setzen...

source: Set Segment Duration...
de: Segment Dauer setzen...

source: Load track parameters preset
de: Lade Spurparameter Voreinstellungen

source: Select preset track parameters for:
de: Wähle Spurparameter Voreinstellungen für:

source: Create appropriate notation for:
de: Erstelle eine geeignete Notation für:

source: Category
de: Kategorie

source: Player Ability
de: Spieler Fähigkeit

source: Professional
de: Professionell

source: Only selected segments
de: Nur a&usgewählte Segmente

source: All segments in this track
de: Auf alle Segmente auf dieser Spur

source: Only for new segments
de: Nur für neue Segmente

source: B%1
de: H%1

source: Can't open preset file %1
de: Datei mit Voreinstellungen %1 kann nicht geöffnet werden

source: &Halve Durations
de: Dauer &halbieren

source: &Double Durations
de: Dauer &verdoppeln

source: Show Velocity Property Ruler
de: Leiste für Anschlagstärke zeigen

source: Insert item
de: Note einfügen

source: Erase selected items
de: Ausgewählte Objekte löschen

source: Clear ruler
de: Lineal löschen

source: Insert line of controllers
de: Controller-Linie einfügen

source: Flip forward
de: Flippe vorwärts

source: Flip backwards
de: Flippe rückwärts

source: Draw property line
de: Eigenschaftenlinie zeichnen

source: Select all property values
de: Alle Eigenschaften auswählen

source: %1 flat
de: %1 b

source: &Insert Note
de: Note &einfügen

source: &Upper Octave
de: &Obere Oktave

source: &Lower Octave
de: &Untere Oktave

source: Estimated time signature shown
de: Ermittelte Taktart wird angezeigt

source: Halving durations...
de: Dauer halbieren...

source: Doubling durations...
de: Dauer verdoppeln...

source: Rescaling...
de: &Reskalieren...

source: By number of semitones:
de: Anzahl der Halbtöne, um die transponiert werden soll:

source: Transposing...
de: Transponieren...

source: Transposing up one semitone...
de: Einen Halbton nach oben transponieren...

source: Transposing up one octave...
de: Eine Oktave nach oben transponieren...

source: Transposing down one semitone...
de: Einen Halbton nach unten transponieren...

source: Transposing down one octave...
de: Eine Oktave nach unten transponieren...

source: Inverting...
de: Spiegele Tonhöhenverlauf...

source: Retrograding...
de: Spiegele zeitlich (retro)...

source: Retrograde inverting...
de: Spiegele zeitlich und tonhöhig...

source: Jogging left...
de: Nach links joggen...

source: Jogging right...
de: Nach rechts joggen...

source: Downloading file %1
de: Lade gerade Datei %1 herunter

source: Converting audio file...
de: Audiodatei wird gerade konvertiert...

source: Turn Repeats into Copies
de: Wiederholungen in Kopien umwandeln

source: Rename Track
de: Spur umbenennen

source: Stretch or S&quash...
de: Strecken oder Stauchen...

source: Re&label...
de: Um&benennen...

source: Resize Segment
de: Segmentgröße verändern

source: Remove &Tempo Change...
de: &Tempoveränderungen entfernen...

source: Erase Segment
de: Segment löschen

source: Paste as New Triggered Segment
de: Als neues getriggertes Segment einfügen

source: Change Segment Color Map...
de: Segment Farbtabelle ändern...

source: Quick-Copy Segment
de: Schnelle Segmentkopie

source: Split Audio Segment
de: Audiosegment splitten

source: Label Segments
de: Segmente kennzeichnen

source: Open or Close Range
de: Bereich öffnen oder schließen

source: Transpose by &Interval...
de: Transponiere um ein &Interval...

source: (part %1)
de: (Teil %1)

source: Create Segment
de: Segmente erzeugen

source: unknown audio file
de: unbekannte Audiodatei>

source: Set Tempos from Beat Segment
de: Erstelle Tempos von einem 'Beat Segment'

source: Split by &Recording Source...
de: Nach Aufnahmequelle aufteilen...

source: Change Segment Color Map
de: Segment Farbtabelle ändern

source: (copied)
de: (kopiert)

source: Change Segment Color...
de: Segmentfarbe ändern...

source: Turn Single Repeat into Copy
de: Wiederholungen in Kopien umwandeln

source: Add Te&mpo Change...
de: Te&mpoänderung hinzufügen...

source: &Split on Silence
de: Bei Pause &splitten

source: Set Base Velocity
de: Basis Anschlagstärke setzen

source: Delete Range
de: Bereich löschen

source: Change &Composition Start and End...
de: Anfang und Ende der Komposition ändern...

source: Move Tracks...
de: Spuren bewegen...

source: Change Segment Color
de: Segmentfarbe ändern

source: Distribute Audio Segments over MIDI
de: Verteile Audio Segmente über MIDI

source: Add Time Si&gnature Change...
de: Änderung der &Taktart hinzufügen...

source: Add Triggered Segment
de: Getriggertes Segment hinzufügen

source: Set Default Time Adjust
de: Standard Zeitadjustierung setzen

source: Remove &Time Signature Change...
de: Taktartänderung entfernen...

source: Repeat Segments
de: Segmente wiederholen

source: Add Tracks...
de: Spuren hinzufügen...

source: Modify &Default Tempo...
de: &Standardtempo.ändern...

source: Split by &Pitch...
de: Nach &Tonhöhe aufteilen...

source: Delete Triggered Segment
de: Getriggertes Segment löschen

source: Split Segment
de: Segment teilen

source: Delete Tracks...
de: Spuren löschen...

source: Insert Range
de: Leeren Bereich einfügen

source: Rejoin Command
de: Ernerut verbinden Befehl

source: Set Base Pitch
de: Grundstimmung setzen

source: Paste Tempos and Time Signatures
de: Tempi und Taktarten einfügen

source: Insert Note
de: Note einfügen

source: Erase Note
de: Note löschen

source: Insert Percussion Note
de: Percussionnote einfügen

source: Move Note
de: Note bewegen

source: Modify Note
de: Note ändern

source: Paste into an existing gap ["restricted"]
de: In vorhandene Lücke einfügen ["eingeschränkt"]

source: Erase existing events to make room ["simple"]
de: Vorhandene Events löschen, um Plazu zu machen ["einfach"]

source: Move existing events out of the way ["open-n-paste"]
de: Vorhandene Events wegschieben ["öffnen + einfügen"]

source: Overlay notes, tying against present notes ["note-overlay"]
de: Noten überlagern und an bestehende Noten binden ["Noten-Überlagern"]

source: Overlay notes, ignoring present notes ["matrix-overlay"]
de: Noten überlagern und bestehenden Noten ignorieren ["Matrix-Überlagern"]

source: &Add Dot
de: Punktierung hinzufügen

source: &Remove Marker
de: Ma&rker löschen

source: Unquantize Events
de: Events entquantisieren

source: &Increase Velocity
de: Anschlagstärke er&höhen

source: &Reduce Velocity
de: Anschlagstärke &verringern

source: (excerpt)
de: (Auszug)

source: Insert Event
de: Event einfügen

source: Insert Trigger Note
de: Note einfügen

source: Collapse &Equal-Pitch Notes
de: Gleich hohe Not&en zusammenfassen

source: &Up a Semitone
de: Halbton a&ufwärts

source: &Down a Semitone
de: Halbton a&bwärts

source: Up an &Octave
de: &Oktave höher

source: Down an Octa&ve
de: Oktave her&unter

source: &Transpose by Semitones...
de: Transponiere um &Halbtonschritte...

source: &Set Note Type
de: Notentyp &setzen

source: Edit E&vent
de: E&vent verändern

source: Set &Property
de: &Eigenschaft setzen

source: &Add Marker
de: Marker hinzufügen

source: Cu&t
de: Sch&neiden

source: &Clear Triggers
de: Trigger löschen

source: Heuristic Notation &Quantize
de: Heuristische Notenquantisierung

source: Grid &Quantize
de: Raster-&Quantisierung

source: &Retrograde
de: &Zeitlich spiegeln (retro)

source: &Invert
de: &Tonhöhenverlauf spiegeln

source: Tri&gger Segment
de: Getri&ggertes Segment

source: Edit L&yrics
de: Te&xt bearbeiten

source: &Move Events to Other Segment
de: Event ausserhalb eines Segments

source: Re&trograde Invert
de: Zeitlich und tonhöhig &spiegeln

source: &Modify Marker
de: Marker verändern

source: &Add Control Parameter
de: Control Parameter hinzufügen

source: Modify &Instrument Mapping
de: &Instrumentzuordnung ändern

source: &Remove Control Parameter
de: Control Parameter entfernen

source: Reconnect Device
de: Gerät wieder verbinden

source: Create Device
de: Gerät erzeugen

source: Modify &MIDI Bank
de: &MIDI Bank ändern

source: Modify &Device Mapping
de: &Gerätezuordnung ändern

source: Rename Device
de: Gerät umbenennen

source: &Modify Control Parameter
de: Control Parameter verändern

source: &Tie
de: Verbinden

source: Add Cle&f Change...
de: &Schlüsselveränderung hinzufügen...

source: Respell with %1
de: Enharmonisch verwechseln mit %1

source: Do&uble Sharp
de: Do&ppelkreuz

source: &Sharp
de: &Kreuz

source: &Flat
de: &b

source: Dou&ble Flat
de: Doppe&l-b

source: &Natural
de: Auf&lösungszeichen

source: N&one
de: &Kein

source: Respell Accidentals &Upward
de: Enharmonisch nach oben

source: Respell Accidentals &Downward
de: Enharmonisch nach unten

source: Respell Accidentals
de: Enharmonisch verwechseln

source: Split-and-Tie Overlapping &Chords
de: Überlappende Akkorde aufteilen und verbinden

source: &Beam Group
de: &Balkengruppe

source: Add Te&xt Mark...
de: Te&xtmarke hinzufügen...

source: Add Pedal &Press
de: Pedaldruck hinzufügen

source: Add Pedal &Release
de: Pedalfreigabe hinzufügen

source: Fi&x Notation Quantization
de: Darstellungsquantisierung korrigieren

source: Stems &Up
de: Notenhälse &aufwärts

source: Stems &Down
de: &Notenhälse abwärts

source: Use &Cautionary Accidentals
de: Zeige Sicherheits-Vorzeichen

source: Cancel C&autionary Accidentals
de: Entferne Sicherheits-Vorzeichen

source: Set Visibility
de: Sichtbarkeit setzen

source: Change &Note Style
de: &Notenstil ändern

source: Insert Text
de: Text einfügen

source: &Interpret...
de: &Interpretieren...

source: &Triplet
de: Triole

source: Tu&plet...
de: &Tuole

source: &Untuplet
de: Tuolen &auflösen

source: &Collapse Rests
de: Pausen &zusammenfassen

source: Add S&lur
de: &Bogen hinzufügen

source: Add &Phrasing Slur
de: &Phrasierungsbogen einfügen

source: Add Double-Octave Up
de: 2 Octaven höher einfügen

source: Add Octave &Up
de: Octave höher einfügen

source: Add Octave &Down
de: Octave tiefer einfügen

source: Add Double Octave Down
de: 2 Octaven tiefer einfügen

source: Add &Crescendo
de: Crescendo einfügen

source: Add &Decrescendo
de: Decrescendo einfügen

source: Add &Glissando
de: Glissando einfügen

source: Add &%1%2
de: Hinzufügen: &%1%2

source: Remo&ve Notation Quantization
de: Darstellungsquantisierung entfernen

source: Make &Chord
de: Akkord

source: Change all to &Key %1...
de: Alles ändern auf &Tonart %1...

source: Add &Key Change...
de: &Tonartveränderung hinzufügen...

source: Tie Notes at &Barlines
de: Noten an Taktstrichen verbinden etc.

source: Slashes
de: Wiederholungsstriche

source: Slur &Above
de: Bogen oberhalb

source: Slur &Below
de: Bogen unterhalb

source: &Normalize Rests
de: Pausen &normalisieren...

source: Edit Text
de: Event verändern

source: &Remove All Marks
de: Alle Ma&rken löschen

source: &Auto-Beam
de: &Automatische Balken

source: &Untie
de: Lösen

source: Tri&ll
de: &Triller

source: Trill &with Line
de: Triller folgt der Linie

source: Trill Line
de: &Triller

source: &Turn
de: &Doppelschlag

source: &Accent
de: &Akzent

source: &Up-Bow
de: A&ufstrich

source: &Down-Bow
de: A&bstrich

source: Inverted Mordent
de: Umgekehrter Mordent

source: Long Mordent
de: Langer Mordent

source: Lon&g Inverted Mordent
de: Langer umgekehrter Mordent

source: Add %1
de: Hinzufügen: %1

source: Fine Reposition
de: Feines Positionieren

source: Change to &Key %1...
de: Wechsel zu Tonart %1...

source: &Remove Fingerings
de: Alle Ma&rken löschen

source: &Unbeam
de: Balken &entfernen

source: Ung&race
de: Verzierung &entfernen

source: Add Other &Fingering...
de: Andere & Fingersatz hinzufügen...

source: Add Fingering &0 (Thumb)
de: Fingersatz &0 (Daumen) einfügen

source: Add Fingering &%1
de: Fingersatz &%1 einfügen

source: imported from Hydrogen
de: von Hydrogen importiert

source: warning: overlong bar truncated here
de: Warnung: Überlanger Takt hier abgeschnitten

source: Nothing to undo
de: Nichts rückgängig zu machen

source: Nothing to redo
de: Nichts zu wiederholen

source: Und&o %1
de: Rückgängig %1

source: Re&do %1
de: %1 &wiederholen

source: The current file has been modified. Do you want to save it?
de: Die aktuelle Datei wurde verändert. Wollen Sie sie speichern?

source: _n: Delete the 1 audio file recorded during the unsaved session? Delete the %n audio files recorded during the unsaved session?
de: _n: Soll die 1 Audio Datei, die während der ungespeicherten Sitzung aufgenommen wurde, gelöscht werden? Sollen die %n Audio Dateien, die während der ungespeicherten Sitzung aufgenommen wurden, gelöscht werden?

source: The following audio files were recorded during this session but have been unloaded from the audio file manager, and so are no longer in use in the document you are saving. You may want to clean up these files to save disk space. Please select any you wish to delete permanently from the hard disk.
de: Die folgenden Audio Dateien wurden zwar während dieser Sitzung aufgenommen, sind aber nicht mehr im Audio Datei Manager geladen und werden daher vom zu speichernden Dokument nicht mehr verwendet. Sie können entscheiden diese Dateien zu löschen um Plattenplatz zu sparen. Bitte wählen diejenigen aus, die Sie permanent von der Festplatte entfernen möchten.

source: Can't open file '%1'
de: Datei %1 kann nicht geöfnet werden '

source: Reading file...
de: Datei wird gelesen...

source: Error when parsing file '%1': "%2"
de: Fehler beim Parsen der Datei '%1': "%2"

source: Generating audio previews...
de: Audio-Vorschau wird erzeugt...

source: Merge
de: Mischen

source: File load cancelled
de: Laden der Datei wurde abgebrochen

source: <h3>Audio and plugins not available</h3><p>This composition uses audio files or plugins, but Rosegarden is currently running without audio because the JACK audio server was not available on startup.</p><p>Please exit Rosegarden, start the JACK audio server and re-start Rosegarden if you wish to load this complete composition.</p><p><b>WARNING:</b> If you re-save this composition, all audio and plugin data and settings in it will be lost.</p>
de: <h3>Audio und Plugins sind nicht verfügbar</h3><p>Diese Komposition verwendet Audiodateien oder Plugins, aber Rosegarden läuft zur Zeit ohne Audio-Unterstützung, weil der 'JACK audio server' bei Programstart nicht verfügbar war.</p><p>Bitte beenden Sie Rosegarden, starten Sie den 'JACK audio server' und starten Sie Rosegarden danach neu, um die ganze Komposition zu laden.</p><p><b>WARNUNG:</b>Wenn Sie diese Komposition jetzt erneut speichern, gehen alle Audio- und Plugindaten verloren !.</p>

source: <h3>Audio and plugins not available</h3><p>This composition uses audio files or plugins, but you are running a version of Rosegarden that was compiled without audio support.</p><p><b>WARNING:</b> If you re-save this composition from this version of Rosegarden, all audio and plugin data and settings in it will be lost.</p>
de: <h3>Audio und Plugins sind nicht verfügbar.</h3><p>Diese Komposition verwendet Audiodateien oder Plugins, aber diese laufende Version von Rosegarden wurde ohne Unterstützung für Audio kompiliert.</p><p><b><b>WARNUNG:</b>Wenn Sie diese Komposition mit dieser Version von Rosegarden erneut speichern, dann gehen alle Audio- und Plugindaten verloren !.</p>
