Repository: nengxu/rosegarden
Catalog: po/*.po
Languages: de

source: Inconsistent sample rates
de: Nicht übereinstimmende 'sample rates' (Anzahl der Samples pro Sekunde)

source: <h3>Plugins not found</h3><p>The following audio plugins could not be loaded:</p><ul>
de: <h3>Plugins wurden nicht gefunden</h3><p>Die folgenden Plugins konnten nicht geladen werden:</p><ul>

source: This file contains one or more old element types that are now deprecated. Support for these elements may disappear in future versions of Rosegarden. We recommend you re-save this file from this version of Rosegarden to ensure that it can still be re-loaded in future versions.
de: Diese Datei enthält mindestens einen veralteten Elementtyp. In Zukunft wird dieser Elementtyp vielleicht nicht mehr unterstützt. Empfehlung: speichern Sie diese Datei aus dieser Version von Rosegarden heraus um sicherzustellen, daß sie auch in Zukunft gelesen werden kann.

source: Insert Recorded MIDI
de: MIDI-Aufnahme einfügen

source: This file was written by Rosegarden %1, and it uses a different file format that cannot be read by this version.
de: Diese Datei wurde von Rosegarden %1 geschrieben und verwendet ein Dateiformat, daß von dieser Version nicht gelesen werden kann.

source: This file was written by Rosegarden %1, which is more recent than this version. There may be some incompatibilities with the file format.
de: Diese Datei wurde von Rosegarden %1 geschrieben. Das ist eine neuere Version, als Sie gerade verwenden. Möglicherweise gibt es Inkompatibilitäten zwischen den Dateiformaten.

source: Loading plugins...
de: Plugins werden geladen...

source: Edit &With
de: Editieren mit

source: Actions Toolbar
de: Aktion-Werkzeugleiste

source: Time Toolbar
de: Zeit-Werkzeugleiste

source: Transport Toolbar
de: Bedienfeld-Werkzeugleiste

source: Zoom Toolbar
de: Zoom-Werkzeugleiste

source: T&ransport
de: &Bedieneinheit

source: Number of Stereo &Inputs
de: Anzahl der Stereo E&ingänge

source: &Number of Submasters
de: A&nzahl Gruppen

source: &Merge
de: &Mischen

source: &Composition
de: Komposition

source: Se&gments
de: Segmente

source: Trac&ks
de: S&puren

source: Set &Instrument
de: Ausgabe-&Instrument für Spur wählen

source: &Toolbars
de: &Werkzeugleisten

source: &Rulers
de: &Lineale anzeigen

source: Tools Toolbar
de: Werkzeug-Werkzeugleiste

source: Tracks Toolbar
de: Spuren-Werkzeugleiste

source: Editors Toolbar
de: Editor-Werkzeugleiste

source: &Layout Mode
de: &Layout Modus

source: Add Event Ruler
de: Event-Lineal hinzufügen

source: Mar&ks
de: Mar&kierungen

source: &Ornaments
de: Verzierungen

source: &Fingerings
de: &Fingersätze

source: S&lashes
de: &Wiederholungsstriche

source: &Accidentals
de: &Vorzeichen

source: Slur &Position
de: &Position des Bindebogen

source: &Octaves
de: &Oktaven

source: Ad&just
de: Anpassen

source: R&ests
de: Pausen

source: &Notes
de: &Noten

source: &Quantize
de: &Quantisieren

source: Trans&pose
de: Trans&ponieren

source: Convert
de: Gewählte Events spie&geln

source: &Fine Positioning
de: &Feine Positionierung

source: Fine Ti&ming
de: Feines Ti&ming

source: &Visibility
de: Sichtbarkeit

source: &Rests
de: &Pausen

source: &Clefs
de: &Schlüssel

source: Local &Cursor
de: Lokaler Zeiger

source: Notes Toolbar
de: Noten-Werkzeugleiste

source: Rests Toolbar
de: Pausen-Werkzeugleiste

source: Clefs Toolbar
de: Schlüssel-Werkzeugleiste

source: Accidentals Toolbar
de: Vorzeichen-Werkzeugleiste

source: Group Toolbar
de: Gruppen-Werkzeugleiste

source: Marks Toolbar
de: Vortragszeichen-Werkzeugleiste

source: Meta Toolbar
de: &Meta-Werkzeugleiste

source: Layout Toolbar
de: &Layout-Werkzeugleiste

source: Control Ruler actions
de: Control-Lineal Aktionen

source: Property Ruler actions
de: Eigenschaften-Lineal Aktionen

source: &Action
de: &Aktion

source: General Toolbar
de: e

source: &Grid
de: &Raster

source: Hide additional controls
de: Zusätzliche Kontrollelemente verbergen

source: Panic Button
de: Not-Halt

source: Resets all MIDI devices if you've got stuck notes
de: Setzt alle MIDI-Geräte zurück bei hängengebliebenen Tönen

source: Provides a metronome click for you to play along with
de: Stellt einen Metronom-Klick zur Verfügung

source: Shows MIDI activity in and out of Rosegarden
de: Zeigt MIDI-Aktivitäten aus Rosegarden heraus und nach Rosegarden hinein

source: Record either MIDI or audio
de: MIDI- oder Audio-Aufnahme

source: Turn on and off the loop markers (if set)
de: Loop-Markierungen an- oder ausschalten (wenn gesetzt)

source: Mutes all but the currently selected track
de: Schaltet alle Spuren stumm bis auf die aktuell angewählte

source: Start loop or range here
de: Beginne Loop oder Bereich hier

source: End loop or range here
de: Beende Loop oder Bereich hier

source: Switch between real time, musical time, and frame count
de: Zwischen Echtzeit, Taktschlägen und SMPTE Frames umschalten

source: Show additional controls
de: Weitere Steuerelemente anzeigen

source: Rewind
de: Zurückspulen

source: Moves the current pointer position back one bar.
de: Bewegt den aktuellen Zeiger einen Takt zurück.

source: Rewind to beginning
de: Zum Beginn zurückspulen

source: Moves the pointer position to the start of the composition. (This may mean going forwards if the pointer is currently before the start.)
de: Bewegt den Zeiger zum Beginn des Stücks. (Wenn sich der Zeiger bereits vor dem Beginn des Stücks befindet, wird der Zeiger entsprechend vorwärts bewegt.)

source: Play/Pause
de: Wiedergabe/Pause

source: Plays from the current pointer position, or pauses playback if already in progress.
de: Spielt von der aktuellen Cursorposition, oder hält die Wiedergabe an, wenn sie schon im Gang ist.

source: Stops playback or recording.
de: Beendet Wiedergabe bzw. Aufnahme

source: Fast forward
de: Schnell vorspulen

source: Moves the current pointer position forwards one bar.
de: Bewegt die aktuelle Cursorposition einen Takt vorwärts.

source: Fast forward to end
de: Schnell ans Ende vorspulen

source: Moves the pointer position to the end of the composition. (This may mean going backwards if the pointer is already beyond the end.)
de: Bewegt den Zeiger zum Ende des Stücks. (Wenn sich der Zeiger bereits hinter dem Ende des Stücks befindet, wird der Zeiger entsprechend zurück bewegt.)

source: Display time to end
de: Zeit bis zum Ende zeigen

source: <p>To configure a track to play using a particular instrument:</p> &nbsp;&nbsp;* click on the track label and hold a moment<br> &nbsp;&nbsp;* select an output device<br> &nbsp;&nbsp;* select one of that device's available instruments (#1 - #16)<br> &nbsp;&nbsp;* adjust that instrument's output channel, program, bank, and controllers via the instrument parameters box
de: <p>Um einer Spur ein bestimmtes Instrument zuzuweisen, gehe wie folgt vor:</p> &nbsp;&nbsp;* klicke für einen Moment auf den Spurnamen<br> &nbsp;&nbsp;* wähle ein Ausgabedevice<br> &nbsp;&nbsp;* wähle eines der verfügbaren Instrumente dieses Devices (#1 - #16)<br> &nbsp;&nbsp;* passe die Instrumentparameter (Ausgabekanal, Programm, Bank und Controller) über die Instrument Parameter Box an

source: <p>...that Rosegarden has an autosave feature?<br><br> You can select your autosave interval from <b>Settings->Configure Rosegarden</b>.<br><br> When something goes awry, such as a power outage or a Rosegarden crash (unfortunately, it happens...) simply load the file you were working on, and you'll be given the option to load the autosaved version, or the unmodified original.</p>
de: <p>...dass Rosegarden ein Autospeichern-Feature hat?<br><br> Sie können den Abstand zwischen zwei automatischen Speicherungen über <b>Einstellungen->Rosegarden</b> einrichten auswählen.<br><br> Wenn etwas schief geht, zum Beispiel ein Stromausfall oder ein Absturz von Rosegarden (das kommt leider vor...), laden Sie einfach die Datei an der Sie gearbeitet haben, und Sie haben dann die Auswahl, ob Sie die automatisch gespeicherte Version oder das unveränderte Original laden wollen.</p>

source: <p>...that your default studio is a complete Rosegarden composition that gets loaded every time you create a new document or import a MIDI file?</p>
de: <p>...dass ihr Standardstudio ein komplettes Rosegarden-Stück ist, das jedesmal geladen wird, wenn Sie ein neues Dokument erzeugen oder eine MIDI-Datei importieren?</p>

source: <p>If you have accidentally recorded a segment so short that it does not appear on the canvas, which you can only hear during subsequent recording sessions, you can gain access to it by using <b>Composition -> Change Composition Start and End</b> and then setting the composition to start at a negative number.</p>
de: <p>Falls Sie versehentlich ein Segment aufgenommen haben, das zu kurz ist, als dass es auf dem Canvas dargestellt wird, das Sie also nur bei nachfolgenden Aufnahmen hören können, so erlangen Sie Zugriff auf dieses Segment, indem Sie <b>Komposition -> Ändern Anfang und Ende der Komposition</b> wählen und dann den Anfang auf einen negativen Wert setzen.</p>

source: <p>...that you can toggle stem directions in the notation editor by selecting one or more notes and using Ctrl-PageUp and Ctrl-PageDown?</p>
de: <p>...dass Sie die Richtung von Notenhälsen verändern können, indem Sie eine oder mehrere Noten auswählen und Strg-BildAuf und Strg-BildAb benutzen?</p>

source: <p>...that you can change the accidental used for a note in the notation editor (without changing the pitch of the note) by selecting it and using the up and down arrow keys with both Ctrl and Shift pressed?</p>
de: <p>...dass Sie im Notationseditor das Vorzeichen einer Note ändern können (ohne die Tonhöhe zu verändern)\ indem Sie sie auswählen und Strg-Shift-Pfeiltaste benutzen??</p>

source: <p>...that you can hold down the Shift key while repositioning segments on the segment canvas in order to avoid the "snap-to" effect and exert finer control?</p>
de: <p>...dass Sie beim Verschieben von Segmenten die Shift-Taste festhalten und so den "Einschnapp-Effekt" vermeiden und feinere Kontrolle ausüben können?</p>

source: <p>...that you can hold down the Shift key while repositioning or resizing events in the matrix view in order to avoid the "snap-to" effect and exert finer control?</p>
de: <p>...dass Sie beim Verschieben von Segmenten die Shift-Taste festhalten und so den "Einschnapp-Effekt" vermeiden und feinere Kontrolle ausüben können?</p>

source: <p>...that you can edit multiple segments on multiple tracks simultaneously in the notation editor? Simply select the segments, then use <b>Edit -> Open in Notation Editor</b>.</p>
de: <p>...dass Sie mehrere Segmente auf mehreren Spuren gleichzeitig im Notationseditor bearbeiten können? Wählen Sie einfach die Segmente aus, und rufen Sie dann <b>Segmente -> Im Notationseditor öffnen</b> auf.</p>

source: <p>...that Rosegarden can export files for use by LilyPond, the high-quality score typesetting system?<br><br> From the <b>File</b> menu, navigate to <b>Export -> Export LilyPond File</b></p>
de: <p>...dass Rosegarden Dateien für die Verwendung mit Lilypond, dem System für anspruchsvollen Notensatz, exportieren kann? Öffnen Sie <b>Datei->Export->Lilypond-Datei exportieren</b></p>

source: <p>...that if you use the quantizer from within the notation view, you can tell it to quantize only the timing used for notation -- making it possible to have good looking notation <b>and</b> a human MIDI performance?</p>
de: <p>...dass der Quantisierer, wenn er aus der Notationsansicht aus aufgerufen wird, nur das für die Notation notwendige Timing quantisieren kann -- und auf diese Weise eine gut aussehende Notation <b>und</b> eine vollständig menschliche MIDI-Darbeitung ermöglicht?</p>

source: <p>...that you can change segment labels using the controls on the Segment Parameters box in the main window?</p>
de: <p>...dass Sie Segmentbeschriftungen über die Segmentparameter-Dialogbox im Hauptfenster ändern können?</p>

source: <p>...that the number of tracks in new documents is based on the contents of your autoload.rg file? <br><br> Whether you prefer to start with three tracks or 43, create a document that contains the desired number of tracks, plus any other studio or document properties settings you wish to configure, and use <b>Composition -> Studio -> Save Current Document as Default Studio</b> to make this your new default.</p>
de: <p>...dass die Anzahl von Spuren in neuen Stücken vom Inhalt Ihrer autoload.rg-Datei abhängt? Wenn Sie lieber mit 3 oder 43 Spuren anfangen wollen, erzeugen Sie einfach ein Dokument mit der gewünschten Anzahl von Spuren sowie der weiteren Sudio- oder Stückeigenschaften, die Sie konfigurieren möchten, und benutzen dann <b>Studio -> Aktuelles Studio als Standardstudio speichern</b>, um dies zu Ihren neuen Standardeinstellungen zu machen.</p>

source: <p>...that you can change the name of a track by double clicking on the label? (The label must be visible for this to work.)</p>
de: <p>...dass Sie den Namen einer Spur verändern können, indem Sie doppelt auf die Beschriftung klicken? (Damit das funktioniert, muss die Beschriftung sichtbar sein.)</p>

source: <p>...that Rosegarden is being developed as a community effort with contributions from around the world?<br><br> The four most active developers live in London (England), Cannes, Barcelona, and... Christiansburg? (Christiansburg is a town of about 50,000 in southwestern Virginia, USA.)<br><br> We have had contributors from elsewhere in the US, UK, Spain, Mexico, Argentina, Germany, Sweden, Russia, Japan, Finland, and Italy, just to name a few...</p>
de: <p>...dass Rosegarden von Freiwilligen aus der ganzen Welt entwickelt wird?<br><br> Die vier zentralen Entwickler leben in London (Großbritannien), Cannes, Barcelona und Christiansburg? (Christiansburg ist eine Stadt mit ca. 50,000 Einwohnern im Südwesten Virginias, USA)<br><br> Weitere Entwickler leben anderswo in den USA, Großbritanien, Spanien, Mexiko, Argentinien, Deutschland, Schweden, Russland, Japan, Finnland und Italien, um nur einige wenige zu nennen...</p>

source: <p>...that Rosegarden is available in Spanish, French, German, Russian, Welsh, Swedish, Italian and Estonian translations? (Just to name a few.)<br><br> If you're interested in translating Rosegarden to another language, drop us a line at <b>rosegarden-devel@lists.sourceforge.net</b>.</p>
de: <p>...dass es Rosegarden auf Spanisch, Französisch, Deutsch, Russisch, Walisisch, Schwedisch, Italienisch und Estisch gibt? (Um nur einige wenige zu nennen)<br><br> Wenn Sie daran interessiert sind, Rosegarden in eine andere Sprache zu übersetzen, schreiben Sie uns doch kurz eine Nachricht an <b>rosegarden-devel@lists.sourceforge.net</b>.</p>

source: <p>...that you can change the total number of bars in the composition via <b>Composition -> Change Composition Start and End</b>?</p>
de: <p>...dass Sie die Gesamtzahl der Takte eines Stücks über <b>Komposition -> Dauer des Stücks verändern</b> ändern können?</p>

source: <p>...that you can see the difference between performance and display duration of duration-quantized notes in the notation editor?<br><br> Use <b>Settings -> Show Raw Note Ruler</b> to turn on this handy feature.<br><br> <i>Note that this feature does not work in page layout view.</i></p>
de: <p>...dass Sie den Unterschied zwischen Länge der Wiedergabe und Länge der Notation für längen-quantisierte Noten im Notationseditor sehen können?<br><br> Rufen Sie <b>Einstellungen -> Rohnotenlineal zeigen</b> auf, um dieses nützliche Feature einzuschalten.<br><br> <i>Achtung: dieses Feature funktioniert nicht in der Seitenlayoutansicht.</i></p>

source: <p>...that you can add tempo and time-signature changes by double-clicking on the values displayed in the transport window or tempo rulers?</p>
de: <p>...dass Sie Veränderungen von Tempo und Taktart einfügen können, indem Sie auf die im Bedienfeld angezeigten Werte doppelt klicken?</p>

source: <p>...if you have more than one note or controller event at the same time, you can use the [ and ] keys to flip the stack of events around on the controller and velocity rulers in order to bring the item you wish to adjust into focus.</p>
de: <p>...falls Sie mehrere Noten- oder Controller-Events zum gleichen Zeitpunkt haben dann können Sie deren Darstellungsreihenfolge im Anschlagdynamik- und Controller- Lineal mit den Tasten [ und ] verändern und so das Ereignis, das Sie verändern möchten, aktivieren.</p>

source: Feta Pixmaps
de: Feta Bitmap

source: Copyright (c) 1997--2003 Han-Wen Nienhuys and Jan Nieuwenhuizen
de: Copyright (c) 1997--2003 Han-Wen Nienhuys und Jan Nieuwenhuizen

source: pixmap
de: Bitmap

source: scalable
de: skalierbar

source: Inkpen is part of Sibelius, but other fonts may use the same mappings.
de: Inkpen gehört zu Sibelius, aber andere Schriftarten verwenden möglicherweise das gleiche Mapping.

source: Maestro is part of Finale, but other fonts use the same mappings.
de: Maestro gehört zu Finale, aber andere Schriftarten verwenden möglicherweise das gleiche Mapping.

source: Opus is part of Sibelius, but other fonts may use the same mappings.
de: Opus gehört zu Sibelius, aber andere Schriftarten verwenden möglicherweise das gleiche Mapping.

source: Petrucci is part of Finale, but other fonts use the same mappings.
de: Petrucci gehört zu Finale, aber andere Schriftarten verwenden möglicherweise das gleiche Mapping.

source: The Steinberg Notation font is part of Cubase.
de: Die Schriftart Steinberg Notation ist Teil von Cubase.

source: Classical
de: Klassisch

source: Cross
de: Kreuz

source: Mensural
de: Mensurisch

source: Triangle
de: Dreieck
