Repository: nengxu/rosegarden
Catalog: po/*.po
Languages: de

source: Split by Pitch
de: Nach Tonhöhe aufteilen

source: Starting split pitch
de: Beginn der Tonhöhenaufteilung

source: Duplicate non-note events
de: Doppelte nicht-Noten-Events

source: Clef handling:
de: Schlüsselbehandlung:

source: Leave clefs alone
de: Schlüssel nicht verändern

source: Guess new clefs
de: Neue Schlüssel raten

source: Use treble and bass clefs
de: Bass- und Violinschlüssel verwenden

source: Rescale
de: Neu skalieren (schneller/langsamer)

source: Duration of selection
de: Dauer der Selektion

source: Adjust times of following events accordingly
de: Passe Zeiten der nachfolgenden Events entsprechend an

source: Document Properties
de: Dokumenteigenschaften

source: Make Ornament
de: Verzierung hinzufügen

source: The name is used to identify both the ornament and the triggered segment that stores the ornament's notes.
de: Der Name dient sowohl der Identifikation der Verzierung, als auch des getriggerten Segments, das die Noten der verzierung enthält.

source: Base pitch
de: Basistonhöhe

source: Specification
de: Spezifikation

source: Preview
de: Vorschau

source: Style:
de: Stil:

source: Dynamic
de: Dynamik

source: Direction
de: Richtung

source: Local Direction
de: Lokale Richtung

source: Local Tempo
de: Lokales Tempo

source: Lyric
de: Text

source: Chord
de: Akkord

source: Annotation
de: Anmerkung

source: LilyPond Directive
de: LilyPond-Anweisung

source: Dynamic:
de: Dynamik:

source: Direction:
de: Richtung:

source: to Coda
de: zur Coda

source: Local Direction:
de: Lokale Richtung:

source: Local Tempo:
de: Lokales Tempo:

source: Directive:
de: Anweisung:

source: Example
de: Beispiel

source: Note Events
de: Noten Events

source: lowest:
de: niedrigste:

source: highest:
de: höchste:

source: Pitch:
de: Tonhöhe:

source: Velocity:
de: Anschlagstärke:

source: Duration:
de: Dauer:Dauer:

source: include
de: einschließen

source: exclude
de: ausschließen

source: edit
de: bearbeiten

source: choose a pitch using a staff
de: Wählen Sie die Tonhöhe im Notensystem aus

source: longest
de: längste

source: Include all
de: Alle einschließen

source: Include entire range of values
de: Gesamten Wertebereich einschließen

source: Exclude all
de: Alle ausschließen

source: Exclude entire range of values
de: Gesamten Wertebereich ausschließen

source: Lowest pitch
de: Niedrigste Tonhöhe

source: Highest pitch
de: Höchste Tonhöhe

source: Use Ornament
de: Verzierung verwenden

source: Display as:
de: Zeige als:

source: Trill
de: Triller

source: Trill with line
de: Triller folgt der Linie

source: Turn
de: Doppelschlag

source: Inverted mordent
de: Mordent umkehren

source: Long mordent
de: Langer Mordent

source: Long inverted mordent
de: Langer umgekehrter Mordent

source: Text mark
de: Textmarke

source: As stored
de: Wie gespeichert

source: Truncate if longer than note
de: Abschneiden, wenn länger als Note

source: End at same time as note
de: Zusammen mit der Note beenden

source: Stretch or squash segment to note duration
de: Strecke oder stauche Segment gemäß Notendauer

source: Adjust pitch to note
de: Tonhöhe an Note anpassen

source: Pitch Selector
de: Tonhöhenauswahl

source: Audio Segment Duration
de: Audio Segment Dauer

source: The selected audio segment contains:
de: Das ausgewählte Audio Segment enthält:

source: beat(s)
de: Taktschlag(äge)

source: bar(s)
de: Takt(e)

source: Tuplet
de: Tuole

source: New timing for tuplet group
de: Neue Teilung für Tuole

source: Play
de: Abspielen

source: in the time of
de: in der Zeit von

source: Timing is already correct: update display only
de: Timing ist bereits korrigiert: aktualisiere Anzeige

source: Timing calculations
de: Timing-Berechnungen

source: Selected region:
de: Ausgewählte Region:

source: Group with current timing:
de: Gruppiere mit aktueller Aufteilung:

source: Group with new timing:
de: Gruppiere mit neuer Aufteilung:

source: Gap created by timing change:
de: Durch Veränderung der Aufteilung erzeugte Lücke:

source: Unchanged at end of selection:
de: Am Ende der Selektion unverändert:

source: Metronome
de: Metronom

source: Metronome Instrument
de: Metronom Instrument

source: Device
de: Gerät

source: Beats
de: Taktschläge

source: Resolution
de: Auflösung

source: None
de: Kein

source: Bars only
de: Nur Takte

source: Bars and beats
de: Takte und Schläge

source: Bars, beats, and divisions
de: Takte, Schläge und Unterteilungen

source: Bar velocity
de: Anschlagstärke des Taktes

source: Beat velocity
de: Anschlagstärke des Schlages

source: Sub-beat velocity
de: Stärke von Schlagteilungen

source: Pitch
de: Tonhöhe

source: for Bar
de: für Takt

source: for Beat
de: für Taktschlag

source: Metronome Activated
de: Metronom eingeschaltet

source: Playing
de: Wiedergabe

source: Recording
de: Aufnahme

source: Choose Text Encoding
de: Textkodierug wählen

source: This file contains text in an unknown language encoding. Please select one of the following estimated text encodings for use with the text in this file:
de: Diese Datei enthält Text in einer unbekannten Kodierung. Bitte wählen aus der Liste der folgenden Kodierungen eine zur Verwendung mit dieser Datei aus:

source: Japanese Shift-JIS
de: Japanisch Shift-JIS

source: Unicode variable-width
de: Unicode variable-Weite

source: Western Europe
de: Westeuropa

source: Western Europe + Euro
de: Westeuropa + Euro

source: Eastern Europe
de: Osteuropa

source: Southern Europe
de: Südeuropa

source: Northern Europe
de: Nordeuropa

source: Cyrillic
de: Kyrillisch

source: Arabic
de: Arabisch

source: Greek
de: Griechisch

source: Hebrew
de: Hebräisch

source: Turkish
de: Türkish

source: Nordic
de: Skandinavisch

source: Thai
de: Thailändisch

source: Baltic
de: Baltisch

source: Celtic
de: Keltisch

source: Traditional Chinese
de: Traditionelles Chinesisch

source: Simplified Chinese
de: Vereinfachtes Chinesisch

source: Russian
de: Russisch

source: Ukrainian
de: Ukrainisch

source: Tamil
de: Tamilisch

source: Example text from file:
de: Beispieltext aus Datei:

source: Time Signature
de: Taktart

source: Time signature
de: Taktart

source: Time where signature takes effect
de: Zeitpunkt zu dem die Taktart angewandt wird

source: Scope
de: Bereich

source: Insertion point is at start of measure %1.
de: Einfügepunkt ist am Beginn von Takt %1.

source: Insertion point is in the middle of measure %1.
de: Einfügepunkt ist in der Mitte von Takt %1

source: Insertion point is at start of composition.
de: Einfügepunkt ist am Beginn des Stücks.

source: Start measure %1 here
de: Takt %1 hier beginnen

source: Change time from start of measure %1
de: Ändere die Zeit vom Beginn des Taktes %1

source: Time change will take effect at the start of measure %1.
de: Die Änderung der Taktart wird zu Beginn des Takts %1 wirksam werden

source: Hide the time signature
de: Zeitstempel verbergen

source: Hide the affected bar lines
de: Verberge die beteiligten Taktstriche

source: Show as common time
de: Zeige als 4/4-tel Takt

source: Correct the durations of following measures
de: Dauer nachfolgender Takte korrigieren

source: Display as common time
de: Als Viervierteltakt anzeigen

source: Display as cut common time
de: Als alla breve anzeigen

source: Configure Rosegarden
de: Rosegarden konfigurieren

source: Edit Marker
de: Marker editieren

source: Marker Time
de: Marker Zeit

source: Marker Properties
de: Marker Eigenschaften

source: Description:
de: Beschreibung

source: Sequencer status
de: Sequenzerstatus

source: Sequencer status:
de: Sequenzerstatus:

source: Status not available.
de: Status nicht verfügbar.

source: Sequencer is not running or is not responding.
de: Der Sequenzer läuft oder antwortet nicht

source: Sequencer is not returning a valid status report.
de: Kein brauchbarer Statusbericht vom Sequenzer

source: Merge File
de: MIDI-Datei mischen

source: Merge new file
de: Neue MIDI-Datei mischen

source: At start of existing composition
de: Am Beginn der existierenden Komposition

source: From end of existing composition
de: Vom Ende der existierenden Komposition

source: The file has different time signatures or tempos.
de: Die Datei hat andere Taktarten oder Tempi

source: Import these as well
de: Diese auch importieren

source: Add Tracks
de: &Mehrere Spuren hinzufügen...

source: How many tracks do you want to add?
de: Wie viele Spuren wollen Sie hinzufügen? (max. 24)

source: Add tracks
de: &Mehrere Spuren hinzufügen

source: At the top
de: Ganz oben

source: Above the current selected track
de: Über die momentan gewählte Spur

source: Below the current selected track
de: Unter die momentan gewählte Spur

source: At the bottom
de: Unterhalb

source: Event Properties
de: Event-Eigenschaften

source: Event type:
de: Eventtyp:

source: Absolute time:
de: Absolute Zeit:

source: <none>
de: <keine>

source: Load data
de: Lade Daten

source: Save data
de: Speichern unter

source: Notation Properties
de: Notationsparameter

source: Lock to changes in performed values
de: Verknüpfe mit Änderungen an ausgeführten Werten

source: Notation time:
de: Notationszeit:

source: Notation duration:
de: Notationsdauer:

source: Note pitch:
de: Tonhöhe:

source: Note velocity:
de: Anschlagstärke:

source: Controller number:
de: Controller Nummer:

source: Controller value:
de: Controller Wert:

source: Key pitch:
de: Tonhöhe:

source: Key pressure:
de: Key Pressure/Aftertouch:

source: Channel pressure:
de: Kanal Pressure/Kanal Aftertouch:

source: Program change:
de: Programmwechsel

source: Data length:
de: Datenlänge:

source: Data:
de: Daten:

source: Text type:
de: Textart:

source: Clef type:
de: Schlüsselart:

source: Key name:
de: Tonartname:

source: Unsupported event type:
de: Nicht unterstütztes Event:

source: Edit Event Time
de: Event Zeit ändern

source: Edit Event Notation Time
de: Event Notationszeit ändern

source: Edit Duration
de: Dauer ändern

source: Edit Notation Duration
de: Notationsdauer ändern

source: Edit Pitch
de: Tonhöhe ändern

source: *.syx|System exclusive files (*.syx)
de: *.syx|System exclusive Dateien (*.syx)

source: Load System Exclusive data in File
de: Lade System Exclusive Daten aus Datei

source: Save System Exclusive data to...
de: Speichere System Exclusive Daten nach...

source: Locate audio file
de: Audiodatei finden

source: &Skip
de: &Überspringen

source: Skip &All
de: &Alles überspringen

source: &Locate
de: &Finden

source: Can't find file "%1". Would you like to try and locate this file or skip it?
de: Die Datei "%1". wurde nicht gefunden. Wollen Sie diese Datei suchen oder überspringen?

source: %1|Requested file (%2) *.wav|WAV files (*.wav)
de: %1|Angeforderte Dateien (%2) *.wav|WAV Dateien (*.wav)

source: Select an Audio File
de: Audiodatei wählen

source: Clef
de: Schlüssel

source: Existing notes following clef change
de: Vorhandene Noten folgen Schlüsseländerung

source: Lower clef
de: Tieferer Schlüssel

source: Up an Octave
de: Oktave höher

source: Down an Octave
de: Oktave herunter

source: Higher clef
de: Höherer Schlüssel

source: Maintain current pitches
de: Aktuelle Tonhöhen beibehalten

source: Transpose into appropriate octave
de: In die richtige Oktave transponieren

source: %1 down an octave
de: %1 Oktave herunter

source: %1 down two octaves
de: %1 zwei Oktaven herunter

source: %1 up an octave
de: %1 Oktave höher

source: %1 up two octaves
de: %1 zwei Oktaven höher

source: Treble
de: Sopran

source: French violin
de: Französische Violine

source: Soprano
de: Sopran

source: Mezzo-soprano
de: Mezzo-Sopran

source: Alto
de: Alt

source: C-baritone
de: C-Bariton

source: F-baritone
de: F-Bariton

source: Bass
de: Baß

source: Recording...
de: Aufnahme läuft...

source: Recording time remaining:
de: Rest-Aufnahmezeit:

source: Just how big is your hard disk?
de: Wie groß ist denn Ihre Festplatte?

source: Recording beyond end of composition:
de: Aufnahme nach dem Ende der Komposition:

source: Specify Interval
de: Intervaleingabe für die Transposition

source: Reference note:
de: Ausgansnote:

source: Target note:
de: Zielnote:

source: Effect on Key
de: Auswirkung auf den Schlüssel

source: Transpose within key
de: Innerhalb der Tonart transponieren

source: Change key for selection
de: Wechsele die Tonart für die Auswahl

source: Adjust segment transposition in opposite direction (maintain audible pitch)
de: Passe die Transposition des Segmentes in entegengesetzter Richtung an (erhalte die hörbare Tonhöhe)

source: a diminished
de: ein Verminderter

source: an augmented
de: ein Übermäßiger

source: a doubly diminished
de: ein doppelt Verminderter

source: a doubly augmented
de: ein doppelt Übermäßgier

source: Intrinsics
de: Interna

source: Event type:
de: Eventtyp:

source: Absolute time:
de: Absolute Zeit:

source: Duration:
de: Dauer:

source: Sub-ordering:
de: Unter - Ordnung

source: Persistent properties
de: Dauerhafte Eigenschaften

source: Type
de: Typ

source: Value
de: Wert

source: Non-persistent properties
de: Nicht-dauerhafte Eigenschaften

source: These are cached values, lost if the event is modified.
de: Diese Werte werden nur im Speicher gehalten und gehen verloren, wenn das Event verändert wird.

source: Type
de: Typ

source: Value
de: Wert

source: Make persistent
de: Dauerhaft machen

source: Delete this property
de: Diese Eigenschaft löschen

source: Are you sure you want to delete the "%1" property? Removing necessary properties may cause unexpected behavior.
de: Sind Sie sicher, dass Sie die Eigenschaft "%1" löschen wollen? Das Löschen benötigter Eigenschaften kann unerwartetes Verhalten hervorrufen.

source: Edit Event
de: Event verändern

source: Are you sure you want to make the "%1" property persistent? This could cause problems if it overrides a different computed value later on.
de: Sind Sie sicher, dass Sie die Eigenschaft "%1" dauerhaft machen wollen? Dies könnte Probleme verursachen, wenn so später ein berechneter Wert überschrieben wird.

source: Make &Persistent
de: &Dauerhaft machen

source: Edit Lyrics
de: Text editieren

source: Lyrics for this segment
de: Text für dieses Segment

source: Add Verse
de: Verse hinzufügen

source: Paste type
de: Typ einfügen

source: Make this the default paste type
de: Dies zum Standard-Einfügemodus machen

source: Import from Device...
de: Importieren von Gerät...

source: Cannot download file %1
de: Kann Datei %1 nicht herunterladen

source: Cannot open file %1
de: Datei %1 kann nicht geöfnet werden '

source: No devices found in file %1
de: Keine Geräte in der Datei gefunden

source: Source device
de: Quell-Gerät

source: Import from:
de: Bänke importieren von Gerät...

source: Device %1
de: Gerät %1

source: Import banks
de: Bänke importieren

source: Import key mappings
de: Bänke exportieren

source: Import controllers
de: %1 Controller

source: Import device name
de: Name des Import-Geräts

source: Bank import behavior
de: Import-Verhalten

source: Merge banks
de: Bänke mischen

source: Overwrite banks
de: Bänke überschreiben

source: Split by Recording Source
de: Nach Aufnahmequelle aufteilen

source: Recording Source
de: Aufnahmequelle

source: Channel:
de: Kanal:

source: any
de: Irgendein

source: Device:
de: Gerät:

source: No connection
de: Keine Verbindung

source: Select Unused Audio Files
de: Nicht verwendete Audiodateien auswählen

source: File name
de: Dateiname

source: File size
de: Dateigröße:

source: Last modified date
de: Letztes Änderungsdatum

source: (not found)
de: (nicht gefunden)

source: Audio File Manager
de: Audiodatei Manager

source: * Some audio files are encoded at a sample rate different from that of the JACK audio server. Rosegarden will play them at the correct speed, but they will sound terrible. Please consider resampling such files externally, or adjusting the sample rate of the JACK server.
de: * Einige der Audio Dateien haben eine andere Samplefrequenz als der JACK Audio Server. Rosegarden wird sie zwar mit der richtigen Geschwindigkeit abspielen, aber der Klang wird vermutlich furchtbar sein. Sie sollten versuchen, die Samplerate dieser Dateien extern zu ändern, oder aber ggf. die Samplefrequenz des JACK Servers anpassen.

source: &Add Audio File...
de: Audiodatei hinzufügen...

source: &Unload Audio File
de: Audiodatei herausnehmen

source: &Play Preview
de: Vorschau abspielen

source: &Insert into Selected Audio Track
de: &In ausgewählte Audiospur einfügen

source: Unload &all Audio Files
de: Alle Audiodateien herausnehmen

source: Unload all &Unused Audio Files
de: Alle unbenutzten Audiodateien herausnehmen

source: &Delete Unused Audio Files...
de: Nicht verwendete Audiodateien löschen

source: &Export Audio File...
de: Audiodatei exportieren...

source: Duration
de: Dauer

source: Envelope
de: Hüllkurve

source: Sample rate
de: Abtastrate

source: Channels
de: Kanäle

source: <no audio files>
de: <keine Audiodateien>

source: *.wav|WAV files (*.wav)
de: *.wav|WAV-Dateien (*.wav)

source: Choose a name to save this file as
de: Einen Namen wählen, unter dem die Datei abgespeichert werden soll

source: Exporting audio file...
de: Audiodatei wird exportiert...

source: This will unload audio file "%1" and remove all associated segments. Are you sure?
de: Wirklich die Audiodatei "%1" und alle zugehörigen Audiosegmente löschen?

source: Select one or more audio files
de: Eine oder mehrere Audiodateien auswählen

source: This will unload all audio files and remove their associated segments. This action cannot be undone, and associations with these files will be lost. Files will not be removed from your disk. Are you sure?
de: Dies wird alle Audiodateien herausnehmen sowie die zugehörigen Segmente entfernen. Diese Aktion kann nicht rückgängig gemacht werden und alle Segmentzuordnungen sind unwiederbringlich verloren. Die Dateien bleiben jedoch auf der Festplatte erhalten. Wollen Sie das tun?

source: This will unload all audio files that are not associated with any segments in this composition. This action cannot be undone, and associations with these files will be lost. Files will not be removed from your disk. Are you sure?
de: Dies wird alle diejenigen Audiodateien aus der Komposition herausnehmen, die keinem Segment zugeordnet sind. Dies Aktion kann nicht rückgängig gemacht werden. Die Dateien bleiben jedoch auf der Festplatte erhalten. Wollen Sie das tun?

source: The following audio files are not used in the current composition. Please select the ones you wish to delete permanently from the hard disk.
de: Die folgenden Audiodateien werden in der Komposition nicht verwendet. Bitte wählen Sie diejenigen aus, die permanent von der Festplatte gelöscht werden sollen.

source: _n: <qt>About to delete 1 audio file permanently from the hard disk.<br>This action cannot be undone, and there will be no way to recover this file.<br>Are you sure?</qt> <qt>About to delete %n audio files permanently from the hard disk.<br>This action cannot be undone, and there will be no way to recover these files.<br>Are you sure?</qt>
de: _n: Es soll 1 Audiodatei dauerhaft von der Festplatte gelöscht werden. Diese Aktion kann nicht rückgängig gemacht werden und die einmal gelöschte Datei kann danach nicht wieder hergestellt werden. Sind Sie sicher? Es sollen %1 Audiodateien dauerhaft von der Festplatte gelöscht werden. Diese Aktion kann nicht rückgängig gemacht werden und die einmal gelöschten Dateien können danach nicht wieder hergestellt werden. Sind Sie sicher?

source: File %1 could not be deleted.
de: Die Datei %1 konnte nicht gelöscht werden.

source: Change Audio File label
de: Audiodateibezeichung ändern

source: Enter new label
de: Neue Bezeichnung eingeben

source: importing an audio file that needs to be converted or resampled
de: Importiere eine Audiodatei, welche konvertiert oder resampled werden muss

source: Adding audio file...
de: Füge Audiodatei hinzu...

source: Failed to add audio file.
de: Der Sequenzer konnte die Audio-Datei %1 nicht hinzufügen

source: Generating audio preview...
de: Audio-Vorschau wird erzeugt...

source: Try copying this file to a directory where you have write permission and re-add it
de: Versuchen Sie diese Datei in ein Verzeichnis zu kopieren, für das Sie Schreibberechtigung besitzen und fügen Sie sie erneut hinzu

source: Rosegarden Transport
de: Rosegarden Bedienfeld

source: Quantize
de: Quantisieren

source: Advanced
de: Fortgeschritten

source: Export Devices...
de: Geräte exportieren als...

source: Export devices
de: Geräte exportieren

source: Export all devices
de: Alle Geräte exportieren

source: Export selected device only
de: Nur ausgewählte Geräte exportieren

source: Change Composition Length
de: Länge des Stücks verändern

source: Set the Start and End bar markers for this Composition
de: Anfangs- und Endtaktstriche für dieses Stück setzen

source: Start Bar
de: Anfangstakt

source: End Bar
de: Endtakt

source: LilyPond Export/Preview
de: LilyPond Export/Vorschau

source: General options
de: Allgemeine Konfiguration

source: Advanced options
de: Experteneinstellungen

source: do not specify
de: keine Angabe

source: All tracks
de: Alle Spuren

source: Non-muted tracks
de: Nicht-stummgeschaltete Spuren

source: Selected track
de: &Ausgewählte Spur

source: Selected segments
de: &Ausgewählte Segmente

source: Merge tracks that have the same name
de: Zusammenführen gleichnamiger Spuren

source: All
de: Alle

source: Export tempo marks
de: Exportiere Tempo-Markierungen

source: Export beamings
de: Notenhälse exportieren

source: Interpret chord texts as lead sheet chord names
de: Interpretiere die Akkord-Texte als 'Lead-Sheet'-Akkordnamen

source: Miscellaneous options
de: Verschiedene Optionen

source: Enable "point and click" debugging
de: "point and click" Debugging einschalten

source: Export \midi block
de: \midi-Block exportieren

source: Autosplit Audio Segment
de: Audiosegment-Autosplit

source: Threshold
de: Schwelle

source: <no preview generated for this audio file>
de: <keine Vorschau für diese Audiodatei erzeugt>

source: Editor
de: Audio bearbeiten

source: Category:
de: Kategorie:

source: Select a plugin from this list.
de: Ein Plugin aus der Liste wählen.

source: Bypass this plugin.
de: Dieses Plugin umgehen.

source: <ports>
de: <Anschlüsse>

source: Input and output port counts.
de: Anzahl Eingans- und Ausgangsanschlüsse.

source: Unique ID of plugin.
de: Eindeutige ID des Plugin.

source: Copy plugin parameters
de: Plugin-Parameter kopieren

source: Paste plugin parameters
de: Plugin-Parameter einfügen

source: Set to defaults
de: Auf Standardeinstellungen setzen

source: (any)
de: (irgendwelche)

source: (unclassified)
de: (nicht näher bestimmt)

source: (none)
de: (keine)

source: <no plugin>
de: <kein Plugin>

source: This plugin has too many controls to edit here.
de: Das Plugin verfügt über mehr Controls, als hier editiert werden können.

source: Id: %1
de: Hinzufügen: %1

source: Program:
de: Programm:

source: <none selected>
de: <keine ausgewählt>

source: Set the %1 property of the event selection:
de: Die %1 - Eigenschaft für die Eventauswahl setzen:

source: Pattern
de: Muster

source: Flat - set %1 to value
de: Flach - %1 auf den Wert setzen

source: Alternating - set %1 to max and min on alternate events
de: Abwechselnd - %1 abwechselnd auf Max und Min setzen

source: Crescendo - set %1 rising from min to max
de: Crescendo - %1 von Min auf Max steigen lassen

source: Diminuendo - set %1 falling from max to min
de: Diminuendo - %1 von Max auf Min verringern

source: Ringing - set %1 alternating from max to min with both dying to zero
de: Ausklingen - %1 abwechselnd auf Max und Min setzen, dabei bis auf 0 verringern

source: First Value
de: Erster Wert

source: Second Value
de: Zweiter Wert

source: Low Value
de: LSB-Wert

source: High Value
de: Erster Wert

source: Insert Tempo Change
de: Te&mpoveränderung einfügen

source: New tempo:
de: Neues Tempo:
